{
    "2401.08417v3": {
        "paper_id": "2401.08417v3",
        "abs_url": "https://arxiv.org/abs/2401.08417v3",
        "pdf_url": "https://arxiv.org/pdf/2401.08417v3.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2401.08417v3_Contrastive_Preference_Optimization_Pushing_the_Boundaries_of_LLM_Performance_in_Machine_Translation.pdf",
        "title": "Contrastive Preference Optimization: Pushing the Boundaries of LLM Performance in Machine Translation",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Haoran Xu",
            "Amr Sharaf",
            "Yunmo Chen",
            "Weiting Tan",
            "Lingfeng Shen",
            "Benjamin Van Durme",
            "Kenton Murray",
            "Young Jin Kim"
        ],
        "abstract": "Moderate-sized large language models (LLMs) -- those with 7B or 13B parameters -- exhibit promising machine translation (MT) performance. However, even the top-performing 13B LLM-based translation models, like ALMA, does not match the performance of state-of-the-art conventional encoder-decoder translation models or larger-scale LLMs such as GPT-4. In this study, we bridge this performance gap. We first assess the shortcomings of supervised fine-tuning for LLMs in the MT task, emphasizing the quality issues present in the reference data, despite being human-generated. Then, in contrast to SFT which mimics reference translations, we introduce Contrastive Preference Optimization (CPO), a novel approach that trains models to avoid generating adequate but not perfect translations. Applying CPO to ALMA models with only 22K parallel sentences and 12M parameters yields significant improvements. The resulting model, called ALMA-R, can match or exceed the performance of the WMT competition winners and GPT-4 on WMT'21, WMT'22 and WMT'23 test datasets.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/fe1ixxu/alma"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/contrastive-preference-optimization-pushing",
        "bibtex": "@misc{xu2024contrastive,\n      title={Contrastive Preference Optimization: Pushing the Boundaries of LLM Performance in Machine Translation}, \n      author={Haoran Xu and Amr Sharaf and Yunmo Chen and Weiting Tan and Lingfeng Shen and Benjamin Van Durme and Kenton Murray and Young Jin Kim},\n      year={2024},\n      eprint={2401.08417},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}