{
    "2404.19705v2": {
        "paper_id": "2404.19705v2",
        "abs_url": "https://arxiv.org/abs/2404.19705v2",
        "pdf_url": "https://arxiv.org/pdf/2404.19705v2.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.19705v2_When_to_Retrieve_Teaching_LLMs_to_Utilize_Information_Retrieval_Effectively.pdf",
        "title": "When to Retrieve: Teaching LLMs to Utilize Information Retrieval Effectively",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Tiziano Labruna",
            "Jon Ander Campos",
            "Gorka Azkune"
        ],
        "abstract": "In this paper, we demonstrate how Large Language Models (LLMs) can effectively learn to use an off-the-shelf information retrieval (IR) system specifically when additional context is required to answer a given question. Given the performance of IR systems, the optimal strategy for question answering does not always entail external information retrieval; rather, it often involves leveraging the parametric memory of the LLM itself. Prior research has identified this phenomenon in the PopQA dataset, wherein the most popular questions are effectively addressed using the LLM's parametric memory, while less popular ones require IR system usage. Following this, we propose a tailored training approach for LLMs, leveraging existing open-domain question answering datasets. Here, LLMs are trained to generate a special token, <RET>, when they do not know the answer to a question. Our evaluation of the Adaptive Retrieval LLM (Adapt-LLM) on the PopQA dataset showcases improvements over the same LLM under three configurations: (i) retrieving information for all the questions, (ii) using always the parametric memory of the LLM, and (iii) using a popularity threshold to decide when to use a retriever. Through our analysis, we demonstrate that Adapt-LLM is able to generate the <RET> token when it determines that it does not know how to answer a question, indicating the need for IR, while it achieves notably high accuracy levels when it chooses to rely only on its parametric memory.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/when-to-retrieve-teaching-llms-to-utilize",
        "bibtex": "@misc{labruna2024retrieve,\n      title={When to Retrieve: Teaching LLMs to Utilize Information Retrieval Effectively}, \n      author={Tiziano Labruna and Jon Ander Campos and Gorka Azkune},\n      year={2024},\n      eprint={2404.19705},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}