{
    "2312.09256": {
        "paper_id": "2312.09256",
        "abs_url": "https://arxiv.org/abs/2312.09256",
        "pdf_url": "https://arxiv.org/pdf/2312.09256.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2312.09256_LIME_Localized_Image_Editing_via_Attention_Regularization_in_Diffusion_Models.pdf",
        "title": "LIME: Localized Image Editing via Attention Regularization in Diffusion Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Enis Simsar",
            "Alessio Tonioni",
            "Yongqin Xian",
            "Thomas Hofmann",
            "Federico Tombari"
        ],
        "abstract": "Diffusion models (DMs) have gained prominence due to their ability to generate high-quality, varied images, with recent advancements in text-to-image generation. The research focus is now shifting towards the controllability of DMs. A significant challenge within this domain is localized editing, where specific areas of an image are modified without affecting the rest of the content. This paper introduces LIME for localized image editing in diffusion models that do not require user-specified regions of interest (RoI) or additional text input. Our method employs features from pre-trained methods and a simple clustering technique to obtain precise semantic segmentation maps. Then, by leveraging cross-attention maps, it refines these segments for localized edits. Finally, we propose a novel cross-attention regularization technique that penalizes unrelated cross-attention scores in the RoI during the denoising steps, ensuring localized edits. Our approach, without re-training and fine-tuning, consistently improves the performance of existing methods in various editing benchmarks.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/lime-localized-image-editing-via-attention",
        "bibtex": "@misc{simsar2023lime,\n      title={LIME: Localized Image Editing via Attention Regularization in Diffusion Models}, \n      author={Enis Simsar and Alessio Tonioni and Yongqin Xian and Thomas Hofmann and Federico Tombari},\n      year={2023},\n      eprint={2312.09256},\n      archivePrefix={arXiv},\n      primaryClass={cs.CV}\n}"
    }
}