{
    "2307.03172": {
        "paper_id": "2307.03172",
        "abs_url": "https://arxiv.org/abs/2307.03172",
        "pdf_url": "https://arxiv.org/pdf/2307.03172.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2307.03172_Lost_in_the_Middle_How_Language_Models_Use_Long_Contexts.pdf",
        "title": "Lost in the Middle: How Language Models Use Long Contexts",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Nelson F. Liu",
            "Kevin Lin",
            "John Hewitt",
            "Ashwin Paranjape",
            "Michele Bevilacqua",
            "Fabio Petroni",
            "Percy Liang"
        ],
        "abstract": "While recent language models have the ability to take long contexts as input, relatively little is known about how well they use longer context. We analyze the performance of language models on two tasks that require identifying relevant information in their input contexts: multi-document question answering and key-value retrieval. We find that performance can degrade significantly when changing the position of relevant information, indicating that current language models do not robustly make use of information in long input contexts. In particular, we observe that performance is often highest when relevant information occurs at the beginning or end of the input context, and significantly degrades when models must access relevant information in the middle of long contexts, even for explicitly long-context models. Our analysis provides a better understanding of how language models use their input context and provides new evaluation protocols for future long-context language models.",
        "comments": "18 pages, 16 figures. Accepted for publication in Transactions of the Association for Computational Linguistics (TACL), 2023",
        "official_code_urls": [
            "https://github.com/nelson-liu/lost-in-the-middle"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/lost-in-the-middle-how-language-models-use",
        "bibtex": "@misc{liu2023lost,\n      title={Lost in the Middle: How Language Models Use Long Contexts}, \n      author={Nelson F. Liu and Kevin Lin and John Hewitt and Ashwin Paranjape and Michele Bevilacqua and Fabio Petroni and Percy Liang},\n      year={2023},\n      eprint={2307.03172},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}