{
    "2403.04706v1": {
        "paper_id": "2403.04706v1",
        "abs_url": "https://arxiv.org/abs/2403.04706v1",
        "pdf_url": "https://arxiv.org/pdf/2403.04706v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2403.04706v1_Common_7B_Language_Models_Already_Possess_Strong_Math_Capabilities.pdf",
        "title": "Common 7B Language Models Already Possess Strong Math Capabilities",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Chen Li",
            "Weiqi Wang",
            "Jingcheng Hu",
            "Yixuan Wei",
            "Nanning Zheng",
            "Han Hu",
            "Zheng Zhang",
            "Houwen Peng"
        ],
        "abstract": "Mathematical capabilities were previously believed to emerge in common language models only at a very large scale or require extensive math-related pre-training. This paper shows that the LLaMA-2 7B model with common pre-training already exhibits strong mathematical abilities, as evidenced by its impressive accuracy of 97.7% and 72.0% on the GSM8K and MATH benchmarks, respectively, when selecting the best response from 256 random generations. The primary issue with the current base model is the difficulty in consistently eliciting its inherent mathematical capabilities. Notably, the accuracy for the first answer drops to 49.5% and 7.9% on the GSM8K and MATH benchmarks, respectively. We find that simply scaling up the SFT data can significantly enhance the reliability of generating correct answers. However, the potential for extensive scaling is constrained by the scarcity of publicly available math questions. To overcome this limitation, we employ synthetic data, which proves to be nearly as effective as real data and shows no clear saturation when scaled up to approximately one million samples. This straightforward approach achieves an accuracy of 82.6% on GSM8K and 40.6% on MATH using LLaMA-2 7B models, surpassing previous models by 14.2% and 20.8%, respectively. We also provide insights into scaling behaviors across different reasoning complexities and error types.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/common-7b-language-models-already-possess",
        "bibtex": "@misc{li2024common,\n      title={Common 7B Language Models Already Possess Strong Math Capabilities}, \n      author={Chen Li and Weiqi Wang and Jingcheng Hu and Yixuan Wei and Nanning Zheng and Han Hu and Zheng Zhang and Houwen Peng},\n      year={2024},\n      eprint={2403.04706},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}