{
    "2303.16755": {
        "paper_id": "2303.16755",
        "abs_url": "https://arxiv.org/abs/2303.16755",
        "pdf_url": "https://arxiv.org/pdf/2303.16755.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2303.16755_Training_Language_Models_with_Language_Feedback_at_Scale.pdf",
        "title": "Training Language Models with Language Feedback at Scale",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Jérémy Scheurer",
            "Jon Ander Campos",
            "Tomasz Korbak",
            "Jun Shern Chan",
            "Angelica Chen",
            "Kyunghyun Cho",
            "Ethan Perez"
        ],
        "abstract": "Pretrained language models often generate outputs that are not in line with human preferences, such as harmful text or factually incorrect summaries. Recent work approaches the above issues by learning from a simple form of human feedback: comparisons between pairs of model-generated outputs. However, comparison feedback only conveys limited information about human preferences. In this paper, we introduce Imitation learning from Language Feedback (ILF), a new approach that utilizes more informative language feedback. ILF consists of three steps that are applied iteratively: first, conditioning the language model on the input, an initial LM output, and feedback to generate refinements. Second, selecting the refinement incorporating the most feedback. Third, finetuning the language model to maximize the likelihood of the chosen refinement given the input. We show theoretically that ILF can be viewed as Bayesian Inference, similar to Reinforcement Learning from human feedback. We evaluate ILF's effectiveness on a carefully-controlled toy task and a realistic summarization task. Our experiments demonstrate that large language models accurately incorporate feedback and that finetuning with ILF scales well with the dataset size, even outperforming finetuning on human summaries. Learning from both language and comparison feedback outperforms learning from each alone, achieving human-level summarization performance.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/jeremyalain/imitation_learning_from_language_feedback"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/training-language-models-with-language",
        "bibtex": "@misc{scheurer2023training,\n      title={Training Language Models with Language Feedback at Scale}, \n      author={Jérémy Scheurer and Jon Ander Campos and Tomasz Korbak and Jun Shern Chan and Angelica Chen and Kyunghyun Cho and Ethan Perez},\n      year={2023},\n      eprint={2303.16755},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}