{
    "2402.00838": {
        "paper_id": "2402.00838",
        "abs_url": "https://arxiv.org/abs/2402.00838",
        "pdf_url": "https://arxiv.org/pdf/2402.00838.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.00838_OLMo_Accelerating_the_Science_of_Language_Models.pdf",
        "title": "OLMo: Accelerating the Science of Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Dirk Groeneveld",
            "Iz Beltagy",
            "Pete Walsh",
            "Akshita Bhagia",
            "Rodney Kinney",
            "Oyvind Tafjord",
            "Ananya Harsh Jha",
            "Hamish Ivison",
            "Ian Magnusson",
            "Yizhong Wang",
            "Shane Arora",
            "David Atkinson",
            "Russell Authur",
            "Khyathi Raghavi Chandu",
            "Arman Cohan",
            "Jennifer Dumas",
            "Yanai Elazar",
            "Yuling Gu",
            "Jack Hessel",
            "Tushar Khot",
            "William Merrill",
            "Jacob Morrison",
            "Niklas Muennighoff",
            "Aakanksha Naik",
            "Crystal Nam",
            "Matthew E. Peters",
            "Valentina Pyatkin",
            "Abhilasha Ravichander",
            "Dustin Schwenk",
            "Saurabh Shah",
            "Will Smith",
            "Emma Strubell",
            "Nishant Subramani",
            "Mitchell Wortsman",
            "Pradeep Dasigi",
            "Nathan Lambert",
            "Kyle Richardson",
            "Luke Zettlemoyer",
            "Jesse Dodge",
            "Kyle Lo",
            "Luca Soldaini",
            "Noah A. Smith",
            "Hannaneh Hajishirzi"
        ],
        "abstract": "Language models (LMs) have become ubiquitous in both NLP research and in commercial product offerings. As their commercial importance has surged, the most powerful models have become closed off, gated behind proprietary interfaces, with important details of their training data, architectures, and development undisclosed. Given the importance of these details in scientifically studying these models, including their biases and potential risks, we believe it is essential for the research community to have access to powerful, truly open LMs. To this end, this technical report details the first release of OLMo, a state-of-the-art, truly Open Language Model and its framework to build and study the science of language modeling. Unlike most prior efforts that have only released model weights and inference code, we release OLMo and the whole framework, including training data and training and evaluation code. We hope this release will empower and strengthen the open research community and inspire a new wave of innovation.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/olmo-accelerating-the-science-of-language",
        "bibtex": "@misc{groeneveld2024olmo,\n      title={OLMo: Accelerating the Science of Language Models}, \n      author={Dirk Groeneveld and Iz Beltagy and Pete Walsh and Akshita Bhagia and Rodney Kinney and Oyvind Tafjord and Ananya Harsh Jha and Hamish Ivison and Ian Magnusson and Yizhong Wang and Shane Arora and David Atkinson and Russell Authur and Khyathi Raghavi Chandu and Arman Cohan and Jennifer Dumas and Yanai Elazar and Yuling Gu and Jack Hessel and Tushar Khot and William Merrill and Jacob Morrison and Niklas Muennighoff and Aakanksha Naik and Crystal Nam and Matthew E. Peters and Valentina Pyatkin and Abhilasha Ravichander and Dustin Schwenk and Saurabh Shah and Will Smith and Emma Strubell and Nishant Subramani and Mitchell Wortsman and Pradeep Dasigi and Nathan Lambert and Kyle Richardson and Luke Zettlemoyer and Jesse Dodge and Kyle Lo and Luca Soldaini and Noah A. Smith and Hannaneh Hajishirzi},\n      year={2024},\n      eprint={2402.00838},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}