{
    "2306.14462": {
        "paper_id": "2306.14462",
        "abs_url": "https://arxiv.org/abs/2306.14462",
        "pdf_url": "https://arxiv.org/pdf/2306.14462.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2306.14462_Multi-task_Item-attribute_Graph_Pre-training_for_Strict_Cold-start_Item_Recommendation.pdf",
        "title": "Multi-task Item-attribute Graph Pre-training for Strict Cold-start Item Recommendation",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Yuwei Cao",
            "Liangwei Yang",
            "Chen Wang",
            "Zhiwei Liu",
            "Hao Peng",
            "Chenyu You",
            "Philip S. Yu"
        ],
        "abstract": "Recommendation systems suffer in the strict cold-start (SCS) scenario, where the user-item interactions are entirely unavailable. The ID-based approaches completely fail to work. Cold-start recommenders, on the other hand, leverage item contents to map the new items to the existing ones. However, the existing SCS recommenders explore item contents in coarse-grained manners that introduce noise or information loss. Moreover, informative data sources other than item contents, such as users' purchase sequences and review texts, are ignored. We explore the role of the fine-grained item attributes in bridging the gaps between the existing and the SCS items and pre-train a knowledgeable item-attribute graph for SCS item recommendation. Our proposed framework, ColdGPT, models item-attribute correlations into an item-attribute graph by extracting fine-grained attributes from item contents. ColdGPT then transfers knowledge into the item-attribute graph from various available data sources, i.e., item contents, historical purchase sequences, and review texts of the existing items, via multi-task learning. To facilitate the positive transfer, ColdGPT designs submodules according to the natural forms of the data sources and coordinates the multiple pre-training tasks via unified alignment-and-uniformity losses. Our pre-trained item-attribute graph acts as an implicit, extendable item embedding matrix, which enables the SCS item embeddings to be easily acquired by inserting these items and propagating their attributes' embeddings. We carefully process three public datasets, i.e., Yelp, Amazon-home, and Amazon-sports, to guarantee the SCS setting for evaluation. Extensive experiments show that ColdGPT consistently outperforms the existing SCS recommenders by large margins and even surpasses models that are pre-trained on 75-224 times more, cross-domain data on two out of four datasets.",
        "comments": "This work has been accepted as a FULL paper in RecSys 2023",
        "official_code_urls": [
            "https://github.com/yuweicao-uic/coldgpt"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/multi-task-item-attribute-graph-pre-training",
        "bibtex": "@misc{cao2023multitask,\n      title={Multi-task Item-attribute Graph Pre-training for Strict Cold-start Item Recommendation}, \n      author={Yuwei Cao and Liangwei Yang and Chen Wang and Zhiwei Liu and Hao Peng and Chenyu You and Philip S. Yu},\n      year={2023},\n      eprint={2306.14462},\n      archivePrefix={arXiv},\n      primaryClass={cs.IR}\n}"
    }
}