{
    "2005.11401": {
        "paper_id": "2005.11401",
        "abs_url": "https://arxiv.org/abs/2005.11401",
        "pdf_url": "https://arxiv.org/pdf/2005.11401.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2005.11401_Retrieval-Augmented_Generation_for_Knowledge-Intensive_NLP_Tasks.pdf",
        "title": "Retrieval-Augmented Generation for Knowledge-Intensive NLP Tasks",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Patrick Lewis",
            "Ethan Perez",
            "Aleksandra Piktus",
            "Fabio Petroni",
            "Vladimir Karpukhin",
            "Naman Goyal",
            "Heinrich Küttler",
            "Mike Lewis",
            "Wen-tau Yih",
            "Tim Rocktäschel",
            "Sebastian Riedel",
            "Douwe Kiela"
        ],
        "abstract": "Large pre-trained language models have been shown to store factual knowledge in their parameters, and achieve state-of-the-art results when fine-tuned on downstream NLP tasks. However, their ability to access and precisely manipulate knowledge is still limited, and hence on knowledge-intensive tasks, their performance lags behind task-specific architectures. Additionally, providing provenance for their decisions and updating their world knowledge remain open research problems. Pre-trained models with a differentiable access mechanism to explicit non-parametric memory can overcome this issue, but have so far been only investigated for extractive downstream tasks. We explore a general-purpose fine-tuning recipe for retrieval-augmented generation (RAG) -- models which combine pre-trained parametric and non-parametric memory for language generation. We introduce RAG models where the parametric memory is a pre-trained seq2seq model and the non-parametric memory is a dense vector index of Wikipedia, accessed with a pre-trained neural retriever. We compare two RAG formulations, one which conditions on the same retrieved passages across the whole generated sequence, the other can use different passages per token. We fine-tune and evaluate our models on a wide range of knowledge-intensive NLP tasks and set the state-of-the-art on three open domain QA tasks, outperforming parametric seq2seq models and task-specific retrieve-and-extract architectures. For language generation tasks, we find that RAG models generate more specific, diverse and factual language than a state-of-the-art parametric-only seq2seq baseline.",
        "comments": "Accepted at NeurIPS 2020",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/retrieval-augmented-generation-for-knowledge",
        "bibtex": "@misc{lewis2021retrievalaugmented,\n      title={Retrieval-Augmented Generation for Knowledge-Intensive NLP Tasks}, \n      author={Patrick Lewis and Ethan Perez and Aleksandra Piktus and Fabio Petroni and Vladimir Karpukhin and Naman Goyal and Heinrich Küttler and Mike Lewis and Wen-tau Yih and Tim Rocktäschel and Sebastian Riedel and Douwe Kiela},\n      year={2021},\n      eprint={2005.11401},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}