{
    "2307.14334": {
        "paper_id": "2307.14334",
        "abs_url": "https://arxiv.org/abs/2307.14334",
        "pdf_url": "https://arxiv.org/pdf/2307.14334.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2307.14334_Towards_Generalist_Biomedical_AI.pdf",
        "title": "Towards Generalist Biomedical AI",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Tao Tu",
            "Shekoofeh Azizi",
            "Danny Driess",
            "Mike Schaekermann",
            "Mohamed Amin",
            "Pi-Chuan Chang",
            "Andrew Carroll",
            "Chuck Lau",
            "Ryutaro Tanno",
            "Ira Ktena",
            "Basil Mustafa",
            "Aakanksha Chowdhery",
            "Yun Liu",
            "Simon Kornblith",
            "David Fleet",
            "Philip Mansfield",
            "Sushant Prakash",
            "Renee Wong",
            "Sunny Virmani",
            "Christopher Semturs",
            "S Sara Mahdavi",
            "Bradley Green",
            "Ewa Dominowska",
            "Blaise Aguera y Arcas",
            "Joelle Barral",
            "Dale Webster",
            "Greg S. Corrado",
            "Yossi Matias",
            "Karan Singhal",
            "Pete Florence",
            "Alan Karthikesalingam",
            "Vivek Natarajan"
        ],
        "abstract": "Medicine is inherently multimodal, with rich data modalities spanning text, imaging, genomics, and more. Generalist biomedical artificial intelligence (AI) systems that flexibly encode, integrate, and interpret this data at scale can potentially enable impactful applications ranging from scientific discovery to care delivery. To enable the development of these models, we first curate MultiMedBench, a new multimodal biomedical benchmark. MultiMedBench encompasses 14 diverse tasks such as medical question answering, mammography and dermatology image interpretation, radiology report generation and summarization, and genomic variant calling. We then introduce Med-PaLM Multimodal (Med-PaLM M), our proof of concept for a generalist biomedical AI system. Med-PaLM M is a large multimodal generative model that flexibly encodes and interprets biomedical data including clinical language, imaging, and genomics with the same set of model weights. Med-PaLM M reaches performance competitive with or exceeding the state of the art on all MultiMedBench tasks, often surpassing specialist models by a wide margin. We also report examples of zero-shot generalization to novel medical concepts and tasks, positive transfer learning across tasks, and emergent zero-shot medical reasoning. To further probe the capabilities and limitations of Med-PaLM M, we conduct a radiologist evaluation of model-generated (and human) chest X-ray reports and observe encouraging performance across model scales. In a side-by-side ranking on 246 retrospective chest X-rays, clinicians express a pairwise preference for Med-PaLM M reports over those produced by radiologists in up to 40.50% of cases, suggesting potential clinical utility. While considerable work is needed to validate these models in real-world use cases, our results represent a milestone towards the development of generalist biomedical AI systems.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/towards-generalist-biomedical-ai",
        "bibtex": "@misc{tu2023generalist,\n      title={Towards Generalist Biomedical AI}, \n      author={Tao Tu and Shekoofeh Azizi and Danny Driess and Mike Schaekermann and Mohamed Amin and Pi-Chuan Chang and Andrew Carroll and Chuck Lau and Ryutaro Tanno and Ira Ktena and Basil Mustafa and Aakanksha Chowdhery and Yun Liu and Simon Kornblith and David Fleet and Philip Mansfield and Sushant Prakash and Renee Wong and Sunny Virmani and Christopher Semturs and S Sara Mahdavi and Bradley Green and Ewa Dominowska and Blaise Aguera y Arcas and Joelle Barral and Dale Webster and Greg S. Corrado and Yossi Matias and Karan Singhal and Pete Florence and Alan Karthikesalingam and Vivek Natarajan},\n      year={2023},\n      eprint={2307.14334},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}