{
    "2403.06634": {
        "paper_id": "2403.06634",
        "abs_url": "https://arxiv.org/abs/2403.06634",
        "pdf_url": "https://arxiv.org/pdf/2403.06634.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2403.06634_Stealing_Part_of_a_Production_Language_Model.pdf",
        "title": "Stealing Part of a Production Language Model",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Nicholas Carlini",
            "Daniel Paleka",
            "Krishnamurthy Dj Dvijotham",
            "Thomas Steinke",
            "Jonathan Hayase",
            "A. Feder Cooper",
            "Katherine Lee",
            "Matthew Jagielski",
            "Milad Nasr",
            "Arthur Conmy",
            "Eric Wallace",
            "David Rolnick",
            "Florian Tramèr"
        ],
        "abstract": "We introduce the first model-stealing attack that extracts precise, nontrivial information from black-box production language models like OpenAI's ChatGPT or Google's PaLM-2. Specifically, our attack recovers the embedding projection layer (up to symmetries) of a transformer model, given typical API access. For under \\$20 USD, our attack extracts the entire projection matrix of OpenAI's Ada and Babbage language models. We thereby confirm, for the first time, that these black-box models have a hidden dimension of 1024 and 2048, respectively. We also recover the exact hidden dimension size of the gpt-3.5-turbo model, and estimate it would cost under \\$2,000 in queries to recover the entire projection matrix. We conclude with potential defenses and mitigations, and discuss the implications of possible future work that could extend our attack.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/stealing-part-of-a-production-language-model",
        "bibtex": "@misc{carlini2024stealing,\n      title={Stealing Part of a Production Language Model}, \n      author={Nicholas Carlini and Daniel Paleka and Krishnamurthy Dj Dvijotham and Thomas Steinke and Jonathan Hayase and A. Feder Cooper and Katherine Lee and Matthew Jagielski and Milad Nasr and Arthur Conmy and Eric Wallace and David Rolnick and Florian Tramèr},\n      year={2024},\n      eprint={2403.06634},\n      archivePrefix={arXiv},\n      primaryClass={cs.CR}\n}"
    }
}