{
    "2402.12847v1": {
        "paper_id": "2402.12847v1",
        "abs_url": "https://arxiv.org/abs/2402.12847v1",
        "pdf_url": "https://arxiv.org/pdf/2402.12847v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.12847v1_Instruction-tuned_Language_Models_are_Better_Knowledge_Learners.pdf",
        "title": "Instruction-tuned Language Models are Better Knowledge Learners",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Zhengbao Jiang",
            "Zhiqing Sun",
            "Weijia Shi",
            "Pedro Rodriguez",
            "Chunting Zhou",
            "Graham Neubig",
            "Xi Victoria Lin",
            "Wen-tau Yih",
            "Srinivasan Iyer"
        ],
        "abstract": "In order for large language model (LLM)-based assistants to effectively adapt to evolving information needs, it must be possible to update their factual knowledge through continued training on new data. The standard recipe for doing so involves continued pre-training on new documents followed by instruction-tuning on question-answer (QA) pairs. However, we find that LLMs trained with this recipe struggle to answer questions, even though the perplexity of documents is minimized. We found that QA pairs are generally straightforward, while documents are more complex, weaving many factual statements together in an intricate manner. Therefore, we hypothesize that it is beneficial to expose LLMs to QA pairs before continued pre-training on documents so that the process of encoding knowledge from complex documents takes into account how this knowledge is accessed through questions. Based on this, we propose pre-instruction-tuning (PIT), a method that instruction-tunes on questions prior to training on documents. This contrasts with standard instruction-tuning, which learns how to extract knowledge after training on documents. Extensive experiments and ablation studies demonstrate that PIT significantly enhances the ability of LLMs to absorb knowledge from new documents, outperforming standard instruction-tuning by 17.8%.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/instruction-tuned-language-models-are-better",
        "bibtex": "@misc{jiang2024instructiontuned,\n      title={Instruction-tuned Language Models are Better Knowledge Learners}, \n      author={Zhengbao Jiang and Zhiqing Sun and Weijia Shi and Pedro Rodriguez and Chunting Zhou and Graham Neubig and Xi Victoria Lin and Wen-tau Yih and Srinivasan Iyer},\n      year={2024},\n      eprint={2402.12847},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}