{
    "2402.07043v1": {
        "paper_id": "2402.07043v1",
        "abs_url": "https://arxiv.org/abs/2402.07043v1",
        "pdf_url": "https://arxiv.org/pdf/2402.07043v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.07043v1_A_Tale_of_Tails_Model_Collapse_as_a_Change_of_Scaling_Laws.pdf",
        "title": "A Tale of Tails: Model Collapse as a Change of Scaling Laws",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Elvis Dohmatob",
            "Yunzhen Feng",
            "Pu Yang",
            "Francois Charton",
            "Julia Kempe"
        ],
        "abstract": "As AI model size grows, neural scaling laws have become a crucial tool to predict the improvements of large models when increasing capacity and the size of original (human or natural) training data. Yet, the widespread use of popular models means that the ecosystem of online data and text will co-evolve to progressively contain increased amounts of synthesized data. In this paper we ask: How will the scaling laws change in the inevitable regime where synthetic data makes its way into the training corpus? Will future models, still improve, or be doomed to degenerate up to total (model) collapse? We develop a theoretical framework of model collapse through the lens of scaling laws. We discover a wide range of decay phenomena, analyzing loss of scaling, shifted scaling with number of generations, the ''un-learning\" of skills, and grokking when mixing human and synthesized data. Our theory is validated by large-scale experiments with a transformer on an arithmetic task and text generation using the large language model Llama2.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/a-tale-of-tails-model-collapse-as-a-change-of",
        "bibtex": "@misc{dohmatob2024tale,\n      title={A Tale of Tails: Model Collapse as a Change of Scaling Laws}, \n      author={Elvis Dohmatob and Yunzhen Feng and Pu Yang and Francois Charton and Julia Kempe},\n      year={2024},\n      eprint={2402.07043},\n      archivePrefix={arXiv},\n      primaryClass={cs.LG}\n}"
    }
}