{
    "2312.08629": {
        "paper_id": "2312.08629",
        "abs_url": "https://arxiv.org/abs/2312.08629",
        "pdf_url": "https://arxiv.org/pdf/2312.08629.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2312.08629_ChatSOS_LLM-based_knowledge_QA_system_for_safety_engineering.pdf",
        "title": "ChatSOS: LLM-based knowledge Q&A system for safety engineering",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Haiyang Tang",
            "Zhenyi Liu",
            "Dongping Chen",
            "Qingzhao Chu"
        ],
        "abstract": "Recent advancements in large language models (LLMs) have notably propelled natural language processing (NLP) capabilities, demonstrating significant potential in safety engineering applications. Despite these advancements, LLMs face constraints in processing specialized tasks, attributed to factors such as corpus size, input processing limitations, and privacy concerns. Obtaining useful information from reliable sources in a limited time is crucial for LLM. Addressing this, our study introduces an LLM-based Q&A system for safety engineering, enhancing the comprehension and response accuracy of the model. We employed prompt engineering to incorporate external knowledge databases, thus enriching the LLM with up-to-date and reliable information. The system analyzes historical incident reports through statistical methods, utilizes vector embedding to construct a vector database, and offers an efficient similarity-based search functionality. Our findings indicate that the integration of external knowledge significantly augments the capabilities of LLM for in-depth problem analysis and autonomous task assignment. It effectively summarizes accident reports and provides pertinent recommendations. This integration approach not only expands LLM applications in safety engineering but also sets a precedent for future developments towards automation and intelligent systems.",
        "comments": "in Chinese language",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/chatsos-llm-based-knowledge-q-a-system-for",
        "bibtex": "@misc{tang2023chatsos,\n      title={ChatSOS: LLM-based knowledge Q&A system for safety engineering}, \n      author={Haiyang Tang and Zhenyi Liu and Dongping Chen and Qingzhao Chu},\n      year={2023},\n      eprint={2312.08629},\n      archivePrefix={arXiv},\n      primaryClass={cs.AI}\n}"
    }
}