{
    "2312.05934v3": {
        "paper_id": "2312.05934v3",
        "abs_url": "https://arxiv.org/abs/2312.05934v3",
        "pdf_url": "https://arxiv.org/pdf/2312.05934v3.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2312.05934v3_Fine-Tuning_or_Retrieval?_Comparing_Knowledge_Injection_in_LLMs.pdf",
        "title": "Fine-Tuning or Retrieval? Comparing Knowledge Injection in LLMs",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Oded Ovadia",
            "Menachem Brief",
            "Moshik Mishaeli",
            "Oren Elisha"
        ],
        "abstract": "Large language models (LLMs) encapsulate a vast amount of factual information within their pre-trained weights, as evidenced by their ability to answer diverse questions across different domains. However, this knowledge is inherently limited, relying heavily on the characteristics of the training data. Consequently, using external datasets to incorporate new information or refine the capabilities of LLMs on previously seen information poses a significant challenge. In this study, we compare two common approaches: unsupervised fine-tuning and retrieval-augmented generation (RAG). We evaluate both approaches on a variety of knowledge-intensive tasks across different topics. Our findings reveal that while unsupervised fine-tuning offers some improvement, RAG consistently outperforms it, both for existing knowledge encountered during training and entirely new knowledge. Moreover, we find that LLMs struggle to learn new factual information through unsupervised fine-tuning, and that exposing them to numerous variations of the same fact during training could alleviate this problem.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/fine-tuning-or-retrieval-comparing-knowledge",
        "bibtex": "@misc{ovadia2024finetuning,\n      title={Fine-Tuning or Retrieval? Comparing Knowledge Injection in LLMs}, \n      author={Oded Ovadia and Menachem Brief and Moshik Mishaeli and Oren Elisha},\n      year={2024},\n      eprint={2312.05934},\n      archivePrefix={arXiv},\n      primaryClass={cs.AI}\n}"
    }
}