{
    "2108.13475": {
        "paper_id": "2108.13475",
        "abs_url": "https://arxiv.org/abs/2108.13475",
        "pdf_url": "https://arxiv.org/pdf/2108.13475.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2108.13475_An_Analysis_Of_Entire_Space_Multi-Task_Models_For_Post-Click_Conversion_Prediction.pdf",
        "title": "An Analysis Of Entire Space Multi-Task Models For Post-Click Conversion Prediction",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Conor O'Brien",
            "Kin Sum Liu",
            "James Neufeld",
            "Rafael Barreto",
            "Jonathan J Hunt"
        ],
        "abstract": "Industrial recommender systems are frequently tasked with approximating probabilities for multiple, often closely related, user actions. For example, predicting if a user will click on an advertisement and if they will then purchase the advertised product. The conceptual similarity between these tasks has promoted the use of multi-task learning: a class of algorithms that aim to bring positive inductive transfer from related tasks. Here, we empirically evaluate multi-task learning approaches with neural networks for an online advertising task. Specifically, we consider approximating the probability of post-click conversion events (installs) (CVR) for mobile app advertising on a large-scale advertising platform, using the related click events (CTR) as an auxiliary task. We use an ablation approach to systematically study recent approaches that incorporate both multitask learning and \"entire space modeling\" which train the CVR on all logged examples rather than learning a conditional likelihood of conversion given clicked. Based on these results we show that several different approaches result in similar levels of positive transfer from the data-abundant CTR task to the CVR task and offer some insight into how the multi-task design choices address the two primary problems affecting the CVR task: data sparsity and data bias. Our findings add to the growing body of evidence suggesting that standard multi-task learning is a sensible approach to modelling related events in real-world large-scale applications and suggest the specific multitask approach can be guided by ease of implementation in an existing system.",
        "comments": "RecSys 21 Late Breaking Results",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/an-analysis-of-entire-space-multi-task-models",
        "bibtex": "@misc{obrien2021analysis,\n      title={An Analysis Of Entire Space Multi-Task Models For Post-Click Conversion Prediction}, \n      author={Conor O'Brien and Kin Sum Liu and James Neufeld and Rafael Barreto and Jonathan J Hunt},\n      year={2021},\n      eprint={2108.13475},\n      archivePrefix={arXiv},\n      primaryClass={cs.IR}\n}"
    }
}