{
    "2312.11562": {
        "paper_id": "2312.11562",
        "abs_url": "https://arxiv.org/abs/2312.11562",
        "pdf_url": "https://arxiv.org/pdf/2312.11562.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2312.11562_A_Survey_of_Reasoning_with_Foundation_Models_Concepts_Methodologies_and_Outlook.pdf",
        "title": "A Survey of Reasoning with Foundation Models: Concepts, Methodologies, and Outlook",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Jiankai Sun",
            "Chuanyang Zheng",
            "Enze Xie",
            "Zhengying Liu",
            "Ruihang Chu",
            "Jianing Qiu",
            "Jiaqi Xu",
            "Mingyu Ding",
            "Hongyang Li",
            "Mengzhe Geng",
            "Yue Wu",
            "Wenhai Wang",
            "Junsong Chen",
            "Zhangyue Yin",
            "Xiaozhe Ren",
            "Jie Fu",
            "Junxian He",
            "Wu Yuan",
            "Qi Liu",
            "Xihui Liu",
            "Yu Li",
            "Hao Dong",
            "Yu Cheng",
            "Ming Zhang",
            "Pheng Ann Heng",
            "Jifeng Dai",
            "Ping Luo",
            "Jingdong Wang",
            "Ji-Rong Wen",
            "Xipeng Qiu",
            "Yike Guo",
            "Hui Xiong",
            "Qun Liu",
            "Zhenguo Li"
        ],
        "abstract": "Reasoning, a crucial ability for complex problem-solving, plays a pivotal role in various real-world settings such as negotiation, medical diagnosis, and criminal investigation. It serves as a fundamental methodology in the field of Artificial General Intelligence (AGI). With the ongoing development of foundation models, there is a growing interest in exploring their abilities in reasoning tasks. In this paper, we introduce seminal foundation models proposed or adaptable for reasoning, highlighting the latest advancements in various reasoning tasks, methods, and benchmarks. We then delve into the potential future directions behind the emergence of reasoning abilities within foundation models. We also discuss the relevance of multimodal learning, autonomous agents, and super alignment in the context of reasoning. By discussing these future research directions, we hope to inspire researchers in their exploration of this field, stimulate further advancements in reasoning with foundation models, and contribute to the development of AGI.",
        "comments": "20 Figures, 160 Pages, 750+ References, Project Page this https URL",
        "official_code_urls": [
            "https://github.com/reasoning-survey/awesome-reasoning-foundation-models"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/a-survey-of-reasoning-with-foundation-models",
        "bibtex": "@misc{sun2023survey,\n      title={A Survey of Reasoning with Foundation Models: Concepts, Methodologies, and Outlook}, \n      author={Jiankai Sun and Chuanyang Zheng and Enze Xie and Zhengying Liu and Ruihang Chu and Jianing Qiu and Jiaqi Xu and Mingyu Ding and Hongyang Li and Mengzhe Geng and Yue Wu and Wenhai Wang and Junsong Chen and Zhangyue Yin and Xiaozhe Ren and Jie Fu and Junxian He and Wu Yuan and Qi Liu and Xihui Liu and Yu Li and Hao Dong and Yu Cheng and Ming Zhang and Pheng Ann Heng and Jifeng Dai and Ping Luo and Jingdong Wang and Ji-Rong Wen and Xipeng Qiu and Yike Guo and Hui Xiong and Qun Liu and Zhenguo Li},\n      year={2023},\n      eprint={2312.11562},\n      archivePrefix={arXiv},\n      primaryClass={cs.AI}\n}"
    }
}