{
    "2311.13165": {
        "paper_id": "2311.13165",
        "abs_url": "https://arxiv.org/abs/2311.13165",
        "pdf_url": "https://arxiv.org/pdf/2311.13165.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2311.13165_Multimodal_Large_Language_Models_A_Survey.pdf",
        "title": "Multimodal Large Language Models: A Survey",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Jiayang Wu",
            "Wensheng Gan",
            "Zefeng Chen",
            "Shicheng Wan",
            "Philip S. Yu"
        ],
        "abstract": "The exploration of multimodal language models integrates multiple data types, such as images, text, language, audio, and other heterogeneity. While the latest large language models excel in text-based tasks, they often struggle to understand and process other data types. Multimodal models address this limitation by combining various modalities, enabling a more comprehensive understanding of diverse data. This paper begins by defining the concept of multimodal and examining the historical development of multimodal algorithms. Furthermore, we introduce a range of multimodal products, focusing on the efforts of major technology companies. A practical guide is provided, offering insights into the technical aspects of multimodal models. Moreover, we present a compilation of the latest algorithms and commonly used datasets, providing researchers with valuable resources for experimentation and evaluation. Lastly, we explore the applications of multimodal models and discuss the challenges associated with their development. By addressing these aspects, this paper aims to facilitate a deeper understanding of multimodal models and their potential in various domains.",
        "comments": "IEEE BigData 2023. 10 pages",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/multimodal-large-language-models-a-survey",
        "bibtex": "@misc{wu2023multimodal,\n      title={Multimodal Large Language Models: A Survey}, \n      author={Jiayang Wu and Wensheng Gan and Zefeng Chen and Shicheng Wan and Philip S. Yu},\n      year={2023},\n      eprint={2311.13165},\n      archivePrefix={arXiv},\n      primaryClass={cs.AI}\n}"
    }
}