{
    "2306.03361": {
        "paper_id": "2306.03361",
        "abs_url": "https://arxiv.org/abs/2306.03361",
        "pdf_url": "https://arxiv.org/pdf/2306.03361.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2306.03361_WHAT_WHEN_and_HOW_to_Ground_Designing_User_Persona-Aware_Conversational_Agents_for_Engaging_Dialogue.pdf",
        "title": "WHAT, WHEN, and HOW to Ground: Designing User Persona-Aware Conversational Agents for Engaging Dialogue",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Deuksin Kwon",
            "Sunwoo Lee",
            "Ki Hyun Kim",
            "Seojin Lee",
            "Taeyoon Kim",
            "Eric Davis"
        ],
        "abstract": "This paper presents a method for building a personalized open-domain dialogue system to address the WWH (WHAT, WHEN, and HOW) problem for natural response generation in a commercial setting, where personalized dialogue responses are heavily interleaved with casual response turns. The proposed approach involves weighted dataset blending, negative persona information augmentation methods, and the design of personalized conversation datasets to address the challenges of WWH in personalized, open-domain dialogue systems. Our work effectively balances dialogue fluency and tendency to ground, while also introducing a response-type label to improve the controllability and explainability of the grounded responses. The combination of these methods leads to more fluent conversations, as evidenced by subjective human evaluations as well as objective evaluations.",
        "comments": "Accepted in ACL 2023 Industry Track",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/textit-what-textit-when-and-textit-how-to",
        "bibtex": "@misc{kwon2023what,\n      title={WHAT, WHEN, and HOW to Ground: Designing User Persona-Aware Conversational Agents for Engaging Dialogue}, \n      author={Deuksin Kwon and Sunwoo Lee and Ki Hyun Kim and Seojin Lee and Taeyoon Kim and Eric Davis},\n      year={2023},\n      eprint={2306.03361},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}