{
    "2401.02994": {
        "paper_id": "2401.02994",
        "abs_url": "https://arxiv.org/abs/2401.02994",
        "pdf_url": "https://arxiv.org/pdf/2401.02994.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2401.02994_Blending_Is_All_You_Need_Cheaper_Better_Alternative_to_Trillion-Parameters_LLM.pdf",
        "title": "Blending Is All You Need: Cheaper, Better Alternative to Trillion-Parameters LLM",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Xiaoding Lu",
            "Adian Liusie",
            "Vyas Raina",
            "Yuwen Zhang",
            "William Beauchamp"
        ],
        "abstract": "In conversational AI research, there's a noticeable trend towards developing models with a larger number of parameters, exemplified by models like ChatGPT. While these expansive models tend to generate increasingly better chat responses, they demand significant computational resources and memory. This study explores a pertinent question: Can a combination of smaller models collaboratively achieve comparable or enhanced performance relative to a singular large model? We introduce an approach termed \"blending\", a straightforward yet effective method of integrating multiple chat AIs. Our empirical evidence suggests that when specific smaller models are synergistically blended, they can potentially outperform or match the capabilities of much larger counterparts. For instance, integrating just three models of moderate size (6B/13B paramaeters) can rival or even surpass the performance metrics of a substantially larger model like ChatGPT (175B+ paramaters). This hypothesis is rigorously tested using A/B testing methodologies with a large user base on the Chai research platform over a span of thirty days. The findings underscore the potential of the \"blending\" strategy as a viable approach for enhancing chat AI efficacy without a corresponding surge in computational demands.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/blending-is-all-you-need-cheaper-better",
        "bibtex": "@misc{lu2024blending,\n      title={Blending Is All You Need: Cheaper, Better Alternative to Trillion-Parameters LLM}, \n      author={Xiaoding Lu and Adian Liusie and Vyas Raina and Yuwen Zhang and William Beauchamp},\n      year={2024},\n      eprint={2401.02994},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}