{
    "2310.11511": {
        "paper_id": "2310.11511",
        "abs_url": "https://arxiv.org/abs/2310.11511",
        "pdf_url": "https://arxiv.org/pdf/2310.11511.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2310.11511_Self-RAG_Learning_to_Retrieve_Generate_and_Critique_through_Self-Reflection.pdf",
        "title": "Self-RAG: Learning to Retrieve, Generate, and Critique through Self-Reflection",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Akari Asai",
            "Zeqiu Wu",
            "Yizhong Wang",
            "Avirup Sil",
            "Hannaneh Hajishirzi"
        ],
        "abstract": "Despite their remarkable capabilities, large language models (LLMs) often produce responses containing factual inaccuracies due to their sole reliance on the parametric knowledge they encapsulate. Retrieval-Augmented Generation (RAG), an ad hoc approach that augments LMs with retrieval of relevant knowledge, decreases such issues. However, indiscriminately retrieving and incorporating a fixed number of retrieved passages, regardless of whether retrieval is necessary, or passages are relevant, diminishes LM versatility or can lead to unhelpful response generation. We introduce a new framework called Self-Reflective Retrieval-Augmented Generation (Self-RAG) that enhances an LM's quality and factuality through retrieval and self-reflection. Our framework trains a single arbitrary LM that adaptively retrieves passages on-demand, and generates and reflects on retrieved passages and its own generations using special tokens, called reflection tokens. Generating reflection tokens makes the LM controllable during the inference phase, enabling it to tailor its behavior to diverse task requirements. Experiments show that Self-RAG (7B and 13B parameters) significantly outperforms state-of-the-art LLMs and retrieval-augmented models on a diverse set of tasks. Specifically, Self-RAG outperforms ChatGPT and retrieval-augmented Llama2-chat on Open-domain QA, reasoning and fact verification tasks, and it shows significant gains in improving factuality and citation accuracy for long-form generations relative to these models.",
        "comments": "30 pages, 2 figures, 12 tables",
        "official_code_urls": [
            "https://github.com/AkariAsai/self-rag"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/self-rag-learning-to-retrieve-generate-and",
        "bibtex": "@misc{asai2023selfrag,\n      title={Self-RAG: Learning to Retrieve, Generate, and Critique through Self-Reflection}, \n      author={Akari Asai and Zeqiu Wu and Yizhong Wang and Avirup Sil and Hannaneh Hajishirzi},\n      year={2023},\n      eprint={2310.11511},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}