{
    "2204.10365": {
        "paper_id": "2204.10365",
        "abs_url": "https://arxiv.org/abs/2204.10365",
        "pdf_url": "https://arxiv.org/pdf/2204.10365.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2204.10365_Towards_an_Enhanced_Understanding_of_Bias_in_Pre-trained_Neural_Language_Models_A_Survey_with_Special_Emphasis_on_Affective_Bias.pdf",
        "title": "Towards an Enhanced Understanding of Bias in Pre-trained Neural Language Models: A Survey with Special Emphasis on Affective Bias",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Anoop K.",
            "Manjary P. Gangan",
            "Deepak P.",
            "Lajish V. L"
        ],
        "abstract": "The remarkable progress in Natural Language Processing (NLP) brought about by deep learning, particularly with the recent advent of large pre-trained neural language models, is brought into scrutiny as several studies began to discuss and report potential biases in NLP applications. Bias in NLP is found to originate from latent historical biases encoded by humans into textual data which gets perpetuated or even amplified by NLP algorithm. We present a survey to comprehend bias in large pre-trained language models, analyze the stages at which they occur in these models, and various ways in which these biases could be quantified and mitigated. Considering wide applicability of textual affective computing based downstream tasks in real-world systems such as business, healthcare, education, etc., we give a special emphasis on investigating bias in the context of affect (emotion) i.e., Affective Bias, in large pre-trained language models. We present a summary of various bias evaluation corpora that help to aid future research and discuss challenges in the research on bias in pre-trained language models. We believe that our attempt to draw a comprehensive view of bias in pre-trained language models, and especially the exploration of affective bias will be highly beneficial to researchers interested in this evolving field.",
        "comments": "Accepted at ICDSE 2021",
        "official_code_urls": [
            "https://github.com/anoopkdcs/nlpbias"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/towards-an-enhanced-understanding-of-bias-in",
        "bibtex": "@misc{k2022enhanced,\n      title={Towards an Enhanced Understanding of Bias in Pre-trained Neural Language Models: A Survey with Special Emphasis on Affective Bias}, \n      author={Anoop K. and Manjary P. Gangan and Deepak P. and Lajish V. L},\n      year={2022},\n      eprint={2204.10365},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}