{
    "2402.16837v1": {
        "paper_id": "2402.16837v1",
        "abs_url": "https://arxiv.org/abs/2402.16837v1",
        "pdf_url": "https://arxiv.org/pdf/2402.16837v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.16837v1_Do_Large_Language_Models_Latently_Perform_Multi-Hop_Reasoning?.pdf",
        "title": "Do Large Language Models Latently Perform Multi-Hop Reasoning?",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Sohee Yang",
            "Elena Gribovskaya",
            "Nora Kassner",
            "Mor Geva",
            "Sebastian Riedel"
        ],
        "abstract": "We study whether Large Language Models (LLMs) latently perform multi-hop reasoning with complex prompts such as \"The mother of the singer of 'Superstition' is\". We look for evidence of a latent reasoning pathway where an LLM (1) latently identifies \"the singer of 'Superstition'\" as Stevie Wonder, the bridge entity, and (2) uses its knowledge of Stevie Wonder's mother to complete the prompt. We analyze these two hops individually and consider their co-occurrence as indicative of latent multi-hop reasoning. For the first hop, we test if changing the prompt to indirectly mention the bridge entity instead of any other entity increases the LLM's internal recall of the bridge entity. For the second hop, we test if increasing this recall causes the LLM to better utilize what it knows about the bridge entity. We find strong evidence of latent multi-hop reasoning for the prompts of certain relation types, with the reasoning pathway used in more than 80% of the prompts. However, the utilization is highly contextual, varying across different types of prompts. Also, on average, the evidence for the second hop and the full multi-hop traversal is rather moderate and only substantial for the first hop. Moreover, we find a clear scaling trend with increasing model size for the first hop of reasoning but not for the second hop. Our experimental findings suggest potential challenges and opportunities for future development and applications of LLMs.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/do-large-language-models-latently-perform",
        "bibtex": "@misc{yang2024large,\n      title={Do Large Language Models Latently Perform Multi-Hop Reasoning?}, \n      author={Sohee Yang and Elena Gribovskaya and Nora Kassner and Mor Geva and Sebastian Riedel},\n      year={2024},\n      eprint={2402.16837},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}