{
    "2310.04799v2": {
        "paper_id": "2310.04799v2",
        "abs_url": "https://arxiv.org/abs/2310.04799v2",
        "pdf_url": "https://arxiv.org/pdf/2310.04799v2.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2310.04799v2_Chat_Vector_A_Simple_Approach_to_Equip_LLMs_with_Instruction_Following_and_Model_Alignment_in_New_Languages.pdf",
        "title": "Chat Vector: A Simple Approach to Equip LLMs with Instruction Following and Model Alignment in New Languages",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Shih-Cheng Huang",
            "Pin-Zu Li",
            "Yu-Chi Hsu",
            "Kuang-Ming Chen",
            "Yu Tung Lin",
            "Shih-Kai Hsiao",
            "Richard Tzong-Han Tsai",
            "Hung-yi Lee"
        ],
        "abstract": "Recently, the development of open-source large language models (LLMs) has advanced rapidly. Nevertheless, due to data constraints, the capabilities of most open-source LLMs are primarily focused on English. To address this issue, we introduce the concept of chat vector to equip pre-trained language models with instruction following and human value alignment via simple model arithmetic. The chat vector is derived by subtracting the weights of a pre-trained base model (e.g. LLaMA2) from those of its corresponding chat model (e.g. LLaMA2-chat). By simply adding the chat vector to a continual pre-trained model's weights, we can endow the model with chat capabilities in new languages without the need for further training. Our empirical studies demonstrate the superior efficacy of the chat vector from three different aspects: instruction following, toxicity mitigation, and multi-turn dialogue. Moreover, to showcase the adaptability of our approach, we extend our experiments to encompass various languages, base models, and chat vectors. The results underscore the chat vector's simplicity, effectiveness, and wide applicability, making it a compelling solution for efficiently enabling conversational capabilities in pre-trained language models.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/chat-vector-a-simple-approach-to-equip-llms",
        "bibtex": "@misc{huang2024chat,\n      title={Chat Vector: A Simple Approach to Equip LLMs with Instruction Following and Model Alignment in New Languages}, \n      author={Shih-Cheng Huang and Pin-Zu Li and Yu-Chi Hsu and Kuang-Ming Chen and Yu Tung Lin and Shih-Kai Hsiao and Richard Tzong-Han Tsai and Hung-yi Lee},\n      year={2024},\n      eprint={2310.04799},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}