{
    "2403.13187v1": {
        "paper_id": "2403.13187v1",
        "abs_url": "https://arxiv.org/abs/2403.13187v1",
        "pdf_url": "https://arxiv.org/pdf/2403.13187v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2403.13187v1_Evolutionary_Optimization_of_Model_Merging_Recipes.pdf",
        "title": "Evolutionary Optimization of Model Merging Recipes",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Takuya Akiba",
            "Makoto Shing",
            "Yujin Tang",
            "Qi Sun",
            "David Ha"
        ],
        "abstract": "We present a novel application of evolutionary algorithms to automate the creation of powerful foundation models. While model merging has emerged as a promising approach for LLM development due to its cost-effectiveness, it currently relies on human intuition and domain knowledge, limiting its potential. Here, we propose an evolutionary approach that overcomes this limitation by automatically discovering effective combinations of diverse open-source models, harnessing their collective intelligence without requiring extensive additional training data or compute. Our approach operates in both parameter space and data flow space, allowing for optimization beyond just the weights of the individual models. This approach even facilitates cross-domain merging, generating models like a Japanese LLM with Math reasoning capabilities. Surprisingly, our Japanese Math LLM achieved state-of-the-art performance on a variety of established Japanese LLM benchmarks, even surpassing models with significantly more parameters, despite not being explicitly trained for such tasks. Furthermore, a culturally-aware Japanese VLM generated through our approach demonstrates its effectiveness in describing Japanese culture-specific content, outperforming previous Japanese VLMs. This work not only contributes new state-of-the-art models back to the open-source community, but also introduces a new paradigm for automated model composition, paving the way for exploring alternative, efficient approaches to foundation model development.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/sakanaai/evolutionary-model-merge"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/evolutionary-optimization-of-model-merging",
        "bibtex": "@misc{akiba2024evolutionary,\n      title={Evolutionary Optimization of Model Merging Recipes}, \n      author={Takuya Akiba and Makoto Shing and Yujin Tang and Qi Sun and David Ha},\n      year={2024},\n      eprint={2403.13187},\n      archivePrefix={arXiv},\n      primaryClass={cs.NE}\n}"
    }
}