{
    "2312.10868": {
        "paper_id": "2312.10868",
        "abs_url": "https://arxiv.org/abs/2312.10868",
        "pdf_url": "https://arxiv.org/pdf/2312.10868.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2312.10868_From_Google_Gemini_to_OpenAI_Q_Q-Star_A_Survey_of_Reshaping_the_Generative_Artificial_Intelligence_AI_Research_Landscape.pdf",
        "title": "From Google Gemini to OpenAI Q* (Q-Star): A Survey of Reshaping the Generative Artificial Intelligence (AI) Research Landscape",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Timothy R. McIntosh",
            "Teo Susnjak",
            "Tong Liu",
            "Paul Watters",
            "Malka N. Halgamuge"
        ],
        "abstract": "This comprehensive survey explored the evolving landscape of generative Artificial Intelligence (AI), with a specific focus on the transformative impacts of Mixture of Experts (MoE), multimodal learning, and the speculated advancements towards Artificial General Intelligence (AGI). It critically examined the current state and future trajectory of generative Artificial Intelligence (AI), exploring how innovations like Google's Gemini and the anticipated OpenAI Q* project are reshaping research priorities and applications across various domains, including an impact analysis on the generative AI research taxonomy. It assessed the computational challenges, scalability, and real-world implications of these technologies while highlighting their potential in driving significant progress in fields like healthcare, finance, and education. It also addressed the emerging academic challenges posed by the proliferation of both AI-themed and AI-generated preprints, examining their impact on the peer-review process and scholarly communication. The study highlighted the importance of incorporating ethical and human-centric methods in AI development, ensuring alignment with societal norms and welfare, and outlined a strategy for future AI research that focuses on a balanced and conscientious use of MoE, multimodality, and AGI in generative AI.",
        "comments": "30 pages",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/from-google-gemini-to-openai-q-q-star-a",
        "bibtex": "@misc{mcintosh2023google,\n      title={From Google Gemini to OpenAI Q* (Q-Star): A Survey of Reshaping the Generative Artificial Intelligence (AI) Research Landscape}, \n      author={Timothy R. McIntosh and Teo Susnjak and Tong Liu and Paul Watters and Malka N. Halgamuge},\n      year={2023},\n      eprint={2312.10868},\n      archivePrefix={arXiv},\n      primaryClass={cs.AI}\n}"
    }
}