{
    "2403.09629": {
        "paper_id": "2403.09629",
        "abs_url": "https://arxiv.org/abs/2403.09629",
        "pdf_url": "https://arxiv.org/pdf/2403.09629.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2403.09629_Quiet-STaR_Language_Models_Can_Teach_Themselves_to_Think_Before_Speaking.pdf",
        "title": "Quiet-STaR: Language Models Can Teach Themselves to Think Before Speaking",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Eric Zelikman",
            "Georges Harik",
            "Yijia Shao",
            "Varuna Jayasiri",
            "Nick Haber",
            "Noah D. Goodman"
        ],
        "abstract": "When writing and talking, people sometimes pause to think. Although reasoning-focused works have often framed reasoning as a method of answering questions or completing agentic tasks, reasoning is implicit in almost all written text. For example, this applies to the steps not stated between the lines of a proof or to the theory of mind underlying a conversation. In the Self-Taught Reasoner (STaR, Zelikman et al. 2022), useful thinking is learned by inferring rationales from few-shot examples in question-answering and learning from those that lead to a correct answer. This is a highly constrained setting -- ideally, a language model could instead learn to infer unstated rationales in arbitrary text. We present Quiet-STaR, a generalization of STaR in which LMs learn to generate rationales at each token to explain future text, improving their predictions. We address key challenges, including 1) the computational cost of generating continuations, 2) the fact that the LM does not initially know how to generate or use internal thoughts, and 3) the need to predict beyond individual next tokens. To resolve these, we propose a tokenwise parallel sampling algorithm, using learnable tokens indicating a thought's start and end, and an extended teacher-forcing technique. Encouragingly, generated rationales disproportionately help model difficult-to-predict tokens and improve the LM's ability to directly answer difficult questions. In particular, after continued pretraining of an LM on a corpus of internet text with Quiet-STaR, we find zero-shot improvements on GSM8K (5.9%$\\rightarrow$10.9%) and CommonsenseQA (36.3%$\\rightarrow$47.2%) and observe a perplexity improvement of difficult tokens in natural text. Crucially, these improvements require no fine-tuning on these tasks. Quiet-STaR marks a step towards LMs that can learn to reason in a more general and scalable way.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/ezelikman/quiet-star"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/quiet-star-language-models-can-teach",
        "bibtex": "@misc{zelikman2024quietstar,\n      title={Quiet-STaR: Language Models Can Teach Themselves to Think Before Speaking}, \n      author={Eric Zelikman and Georges Harik and Yijia Shao and Varuna Jayasiri and Nick Haber and Noah D. Goodman},\n      year={2024},\n      eprint={2403.09629},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}