{
    "2404.05875v1": {
        "paper_id": "2404.05875v1",
        "abs_url": "https://arxiv.org/abs/2404.05875v1",
        "pdf_url": "https://arxiv.org/pdf/2404.05875v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.05875v1_CodecLM_Aligning_Language_Models_with_Tailored_Synthetic_Data.pdf",
        "title": "CodecLM: Aligning Language Models with Tailored Synthetic Data",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Zifeng Wang",
            "Chun-Liang Li",
            "Vincent Perot",
            "Long T. Le",
            "Jin Miao",
            "Zizhao Zhang",
            "Chen-Yu Lee",
            "Tomas Pfister"
        ],
        "abstract": "Instruction tuning has emerged as the key in aligning large language models (LLMs) with specific task instructions, thereby mitigating the discrepancy between the next-token prediction objective and users' actual goals. To reduce the labor and time cost to collect or annotate data by humans, researchers start to explore the use of LLMs to generate instruction-aligned synthetic data. Recent works focus on generating diverse instructions and applying LLM to increase instruction complexity, often neglecting downstream use cases. It remains unclear how to tailor high-quality data to elicit better instruction-following abilities in different target instruction distributions and LLMs. To this end, we introduce CodecLM, a general framework for adaptively generating high-quality synthetic data for LLM alignment with different downstream instruction distributions and LLMs. Drawing on the Encode-Decode principles, we use LLMs as codecs to guide the data generation process. We first encode seed instructions into metadata, which are concise keywords generated on-the-fly to capture the target instruction distribution, and then decode metadata to create tailored instructions. We also introduce Self-Rubrics and Contrastive Filtering during decoding to tailor data-efficient samples. Extensive experiments on four open-domain instruction following benchmarks validate the effectiveness of CodecLM over the current state-of-the-arts.",
        "comments": "Accepted to Findings of NAACL 2024",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/codeclm-aligning-language-models-with",
        "bibtex": "@misc{wang2024codeclm,\n      title={CodecLM: Aligning Language Models with Tailored Synthetic Data}, \n      author={Zifeng Wang and Chun-Liang Li and Vincent Perot and Long T. Le and Jin Miao and Zizhao Zhang and Chen-Yu Lee and Tomas Pfister},\n      year={2024},\n      eprint={2404.05875},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}