{
    "2202.06991": {
        "paper_id": "2202.06991",
        "abs_url": "https://arxiv.org/abs/2202.06991",
        "pdf_url": "https://arxiv.org/pdf/2202.06991.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2202.06991_Transformer_Memory_as_a_Differentiable_Search_Index.pdf",
        "title": "Transformer Memory as a Differentiable Search Index",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Yi Tay",
            "Vinh Q. Tran",
            "Mostafa Dehghani",
            "Jianmo Ni",
            "Dara Bahri",
            "Harsh Mehta",
            "Zhen Qin",
            "Kai Hui",
            "Zhe Zhao",
            "Jai Gupta",
            "Tal Schuster",
            "William W. Cohen",
            "Donald Metzler"
        ],
        "abstract": "In this paper, we demonstrate that information retrieval can be accomplished with a single Transformer, in which all information about the corpus is encoded in the parameters of the model. To this end, we introduce the Differentiable Search Index (DSI), a new paradigm that learns a text-to-text model that maps string queries directly to relevant docids; in other words, a DSI model answers queries directly using only its parameters, dramatically simplifying the whole retrieval process. We study variations in how documents and their identifiers are represented, variations in training procedures, and the interplay between models and corpus sizes. Experiments demonstrate that given appropriate design choices, DSI significantly outperforms strong baselines such as dual encoder models. Moreover, DSI demonstrates strong generalization capabilities, outperforming a BM25 baseline in a zero-shot setup.",
        "comments": "NeurIPS 2022",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/transformer-memory-as-a-differentiable-search",
        "bibtex": "@misc{tay2022transformer,\n      title={Transformer Memory as a Differentiable Search Index}, \n      author={Yi Tay and Vinh Q. Tran and Mostafa Dehghani and Jianmo Ni and Dara Bahri and Harsh Mehta and Zhen Qin and Kai Hui and Zhe Zhao and Jai Gupta and Tal Schuster and William W. Cohen and Donald Metzler},\n      year={2022},\n      eprint={2202.06991},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}