{
    "2403.17887v1": {
        "paper_id": "2403.17887v1",
        "abs_url": "https://arxiv.org/abs/2403.17887v1",
        "pdf_url": "https://arxiv.org/pdf/2403.17887v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2403.17887v1_The_Unreasonable_Ineffectiveness_of_the_Deeper_Layers.pdf",
        "title": "The Unreasonable Ineffectiveness of the Deeper Layers",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Andrey Gromov",
            "Kushal Tirumala",
            "Hassan Shapourian",
            "Paolo Glorioso",
            "Daniel A. Roberts"
        ],
        "abstract": "We empirically study a simple layer-pruning strategy for popular families of open-weight pretrained LLMs, finding minimal degradation of performance on different question-answering benchmarks until after a large fraction (up to half) of the layers are removed. To prune these models, we identify the optimal block of layers to prune by considering similarity across layers; then, to \"heal\" the damage, we perform a small amount of finetuning. In particular, we use parameter-efficient finetuning (PEFT) methods, specifically quantization and Low Rank Adapters (QLoRA), such that each of our experiments can be performed on a single A100 GPU. From a practical perspective, these results suggest that layer pruning methods can complement other PEFT strategies to further reduce computational resources of finetuning on the one hand, and can improve the memory and latency of inference on the other hand. From a scientific perspective, the robustness of these LLMs to the deletion of layers implies either that current pretraining methods are not properly leveraging the parameters in the deeper layers of the network or that the shallow layers play a critical role in storing knowledge.",
        "comments": "12 + 10 pages, 5 + 4 figures",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/the-unreasonable-ineffectiveness-of-the",
        "bibtex": "@misc{gromov2024unreasonable,\n      title={The Unreasonable Ineffectiveness of the Deeper Layers}, \n      author={Andrey Gromov and Kushal Tirumala and Hassan Shapourian and Paolo Glorioso and Daniel A. Roberts},\n      year={2024},\n      eprint={2403.17887},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}