{
    "2401.06066v1": {
        "paper_id": "2401.06066v1",
        "abs_url": "https://arxiv.org/abs/2401.06066v1",
        "pdf_url": "https://arxiv.org/pdf/2401.06066v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2401.06066v1_DeepSeekMoE_Towards_Ultimate_Expert_Specialization_in_Mixture-of-Experts_Language_Models.pdf",
        "title": "DeepSeekMoE: Towards Ultimate Expert Specialization in Mixture-of-Experts Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Damai Dai",
            "Chengqi Deng",
            "Chenggang Zhao",
            "R.X. Xu",
            "Huazuo Gao",
            "Deli Chen",
            "Jiashi Li",
            "Wangding Zeng",
            "Xingkai Yu",
            "Y. Wu",
            "Zhenda Xie",
            "Y.K. Li",
            "Panpan Huang",
            "Fuli Luo",
            "Chong Ruan",
            "Zhifang Sui",
            "Wenfeng Liang"
        ],
        "abstract": "In the era of large language models, Mixture-of-Experts (MoE) is a promising architecture for managing computational costs when scaling up model parameters. However, conventional MoE architectures like GShard, which activate the top-$K$ out of $N$ experts, face challenges in ensuring expert specialization, i.e. each expert acquires non-overlapping and focused knowledge. In response, we propose the DeepSeekMoE architecture towards ultimate expert specialization. It involves two principal strategies: (1) finely segmenting the experts into $mN$ ones and activating $mK$ from them, allowing for a more flexible combination of activated experts; (2) isolating $K_s$ experts as shared ones, aiming at capturing common knowledge and mitigating redundancy in routed experts. Starting from a modest scale with 2B parameters, we demonstrate that DeepSeekMoE 2B achieves comparable performance with GShard 2.9B, which has 1.5 times the expert parameters and computation. In addition, DeepSeekMoE 2B nearly approaches the performance of its dense counterpart with the same number of total parameters, which set the upper bound of MoE models. Subsequently, we scale up DeepSeekMoE to 16B parameters and show that it achieves comparable performance with LLaMA2 7B, with only about 40% of computations. Further, our preliminary efforts to scale up DeepSeekMoE to 145B parameters consistently validate its substantial advantages over the GShard architecture, and show its performance comparable with DeepSeek 67B, using only 28.5% (maybe even 18.2%) of computations.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/deepseek-ai/deepseek-moe"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/deepseekmoe-towards-ultimate-expert",
        "bibtex": "@misc{dai2024deepseekmoe,\n      title={DeepSeekMoE: Towards Ultimate Expert Specialization in Mixture-of-Experts Language Models}, \n      author={Damai Dai and Chengqi Deng and Chenggang Zhao and R. X. Xu and Huazuo Gao and Deli Chen and Jiashi Li and Wangding Zeng and Xingkai Yu and Y. Wu and Zhenda Xie and Y. K. Li and Panpan Huang and Fuli Luo and Chong Ruan and Zhifang Sui and Wenfeng Liang},\n      year={2024},\n      eprint={2401.06066},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}