{
    "2404.04167v3": {
        "paper_id": "2404.04167v3",
        "abs_url": "https://arxiv.org/abs/2404.04167v3",
        "pdf_url": "https://arxiv.org/pdf/2404.04167v3.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.04167v3_Chinese_Tiny_LLM_Pretraining_a_Chinese-Centric_Large_Language_Model.pdf",
        "title": "Chinese Tiny LLM: Pretraining a Chinese-Centric Large Language Model",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Xinrun Du",
            "Zhouliang Yu",
            "Songyang Gao",
            "Ding Pan",
            "Yuyang Cheng",
            "Ziyang Ma",
            "Ruibin Yuan",
            "Xingwei Qu",
            "Jiaheng Liu",
            "Tianyu Zheng",
            "Xinchen Luo",
            "Guorui Zhou",
            "Binhang Yuan",
            "Wenhu Chen",
            "Jie Fu",
            "Ge Zhang"
        ],
        "abstract": "In this study, we introduce CT-LLM, a 2B large language model (LLM) that illustrates a pivotal shift towards prioritizing the Chinese language in developing LLMs. Uniquely initiated from scratch, CT-LLM diverges from the conventional methodology by primarily incorporating Chinese textual data, utilizing an extensive corpus of 1,200 billion tokens, including 800 billion Chinese tokens, 300 billion English tokens, and 100 billion code tokens. This strategic composition facilitates the model's exceptional proficiency in understanding and processing Chinese, a capability further enhanced through alignment techniques. Demonstrating remarkable performance on the CHC-Bench, CT-LLM excels in Chinese language tasks, and showcases its adeptness in English through SFT. This research challenges the prevailing paradigm of training LLMs predominantly on English corpora and then adapting them to other languages, broadening the horizons for LLM training methodologies. By open-sourcing the full process of training a Chinese LLM, including a detailed data processing procedure with the obtained Massive Appropriate Pretraining Chinese Corpus (MAP-CC), a well-chosen multidisciplinary Chinese Hard Case Benchmark (CHC-Bench), and the 2B-size Chinese Tiny LLM (CT-LLM), we aim to foster further exploration and innovation in both academia and industry, paving the way for more inclusive and versatile language models.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/chinese-tiny-llm-pretraining-a-chinese",
        "bibtex": "@misc{du2024chinese,\n      title={Chinese Tiny LLM: Pretraining a Chinese-Centric Large Language Model}, \n      author={Xinrun Du and Zhouliang Yu and Songyang Gao and Ding Pan and Yuyang Cheng and Ziyang Ma and Ruibin Yuan and Xingwei Qu and Jiaheng Liu and Tianyu Zheng and Xinchen Luo and Guorui Zhou and Binhang Yuan and Wenhu Chen and Jie Fu and Ge Zhang},\n      year={2024},\n      eprint={2404.04167},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}