{
    "1801.01207": {
        "paper_id": "1801.01207",
        "abs_url": "https://arxiv.org/abs/1801.01207",
        "pdf_url": "https://arxiv.org/pdf/1801.01207.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "1801.01207_Meltdown.pdf",
        "title": "Meltdown",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Moritz Lipp",
            "Michael Schwarz",
            "Daniel Gruss",
            "Thomas Prescher",
            "Werner Haas",
            "Stefan Mangard",
            "Paul Kocher",
            "Daniel Genkin",
            "Yuval Yarom",
            "Mike Hamburg"
        ],
        "abstract": "The security of computer systems fundamentally relies on memory isolation, e.g., kernel address ranges are marked as non-accessible and are protected from user access. In this paper, we present Meltdown. Meltdown exploits side effects of out-of-order execution on modern processors to read arbitrary kernel-memory locations including personal data and passwords. Out-of-order execution is an indispensable performance feature and present in a wide range of modern processors. The attack works on different Intel microarchitectures since at least 2010 and potentially other processors are affected. The root cause of Meltdown is the hardware. The attack is independent of the operating system, and it does not rely on any software vulnerabilities. Meltdown breaks all security assumptions given by address space isolation as well as paravirtualized environments and, thus, every security mechanism building upon this foundation. On affected systems, Meltdown enables an adversary to read memory of other processes or virtual machines in the cloud without any permissions or privileges, affecting millions of customers and virtually every user of a personal computer. We show that the KAISER defense mechanism for KASLR has the important (but inadvertent) side effect of impeding Meltdown. We stress that KAISER must be deployed immediately to prevent large-scale exploitation of this severe information leakage.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/IAIK/meltdown"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/meltdown",
        "bibtex": "@misc{lipp2018meltdown,\n      title={Meltdown}, \n      author={Moritz Lipp and Michael Schwarz and Daniel Gruss and Thomas Prescher and Werner Haas and Stefan Mangard and Paul Kocher and Daniel Genkin and Yuval Yarom and Mike Hamburg},\n      year={2018},\n      eprint={1801.01207},\n      archivePrefix={arXiv},\n      primaryClass={cs.CR}\n}"
    }
}