{
    "2404.11584v1": {
        "paper_id": "2404.11584v1",
        "abs_url": "https://arxiv.org/abs/2404.11584v1",
        "pdf_url": "https://arxiv.org/pdf/2404.11584v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.11584v1_The_Landscape_of_Emerging_AI_Agent_Architectures_for_Reasoning_Planning_and_Tool_Calling_A_Survey.pdf",
        "title": "The Landscape of Emerging AI Agent Architectures for Reasoning, Planning, and Tool Calling: A Survey",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Tula Masterman",
            "Sandi Besen",
            "Mason Sawtell",
            "Alex Chao"
        ],
        "abstract": "This survey paper examines the recent advancements in AI agent implementations, with a focus on their ability to achieve complex goals that require enhanced reasoning, planning, and tool execution capabilities. The primary objectives of this work are to a) communicate the current capabilities and limitations of existing AI agent implementations, b) share insights gained from our observations of these systems in action, and c) suggest important considerations for future developments in AI agent design. We achieve this by providing overviews of single-agent and multi-agent architectures, identifying key patterns and divergences in design choices, and evaluating their overall impact on accomplishing a provided goal. Our contribution outlines key themes when selecting an agentic architecture, the impact of leadership on agent systems, agent communication styles, and key phases for planning, execution, and reflection that enable robust AI agent systems.",
        "comments": "13 pages,6 figures,38 references",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/the-landscape-of-emerging-ai-agent",
        "bibtex": "@misc{masterman2024landscape,\n      title={The Landscape of Emerging AI Agent Architectures for Reasoning, Planning, and Tool Calling: A Survey}, \n      author={Tula Masterman and Sandi Besen and Mason Sawtell and Alex Chao},\n      year={2024},\n      eprint={2404.11584},\n      archivePrefix={arXiv},\n      primaryClass={cs.AI}\n}"
    }
}