{
    "2402.00159": {
        "paper_id": "2402.00159",
        "abs_url": "https://arxiv.org/abs/2402.00159",
        "pdf_url": "https://arxiv.org/pdf/2402.00159.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.00159_Dolma_an_Open_Corpus_of_Three_Trillion_Tokens_for_Language_Model_Pretraining_Research.pdf",
        "title": "Dolma: an Open Corpus of Three Trillion Tokens for Language Model Pretraining Research",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Luca Soldaini",
            "Rodney Kinney",
            "Akshita Bhagia",
            "Dustin Schwenk",
            "David Atkinson",
            "Russell Authur",
            "Ben Bogin",
            "Khyathi Chandu",
            "Jennifer Dumas",
            "Yanai Elazar",
            "Valentin Hofmann",
            "Ananya Harsh Jha",
            "Sachin Kumar",
            "Li Lucy",
            "Xinxi Lyu",
            "Nathan Lambert",
            "Ian Magnusson",
            "Jacob Morrison",
            "Niklas Muennighoff",
            "Aakanksha Naik",
            "Crystal Nam",
            "Matthew E. Peters",
            "Abhilasha Ravichander",
            "Kyle Richardson",
            "Zejiang Shen",
            "Emma Strubell",
            "Nishant Subramani",
            "Oyvind Tafjord",
            "Pete Walsh",
            "Luke Zettlemoyer",
            "Noah A. Smith",
            "Hannaneh Hajishirzi",
            "Iz Beltagy",
            "Dirk Groeneveld",
            "Jesse Dodge",
            "Kyle Lo"
        ],
        "abstract": "Language models have become a critical technology to tackling a wide range of natural language processing tasks, yet many details about how the best-performing language models were developed are not reported. In particular, information about their pretraining corpora is seldom discussed: commercial language models rarely provide any information about their data; even open models rarely release datasets they are trained on, or an exact recipe to reproduce them. As a result, it is challenging to conduct certain threads of language modeling research, such as understanding how training data impacts model capabilities and shapes their limitations. To facilitate open research on language model pretraining, we release Dolma, a three trillion tokens English corpus, built from a diverse mixture of web content, scientific papers, code, public-domain books, social media, and encyclopedic materials. In addition, we open source our data curation toolkit to enable further experimentation and reproduction of our work. In this report, we document Dolma, including its design principles, details about its construction, and a summary of its contents. We interleave this report with analyses and experimental results from training language models on intermediate states of Dolma to share what we have learned about important data curation practices, including the role of content or quality filters, deduplication, and multi-source mixing. Dolma has been used to train OLMo, a state-of-the-art, open language model and framework designed to build and study the science of language modeling.",
        "comments": "Dataset available at: this https URL",
        "official_code_urls": [
            "https://github.com/allenai/dolma"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/dolma-an-open-corpus-of-three-trillion-tokens",
        "bibtex": "@misc{soldaini2024dolma,\n      title={Dolma: an Open Corpus of Three Trillion Tokens for Language Model Pretraining Research}, \n      author={Luca Soldaini and Rodney Kinney and Akshita Bhagia and Dustin Schwenk and David Atkinson and Russell Authur and Ben Bogin and Khyathi Chandu and Jennifer Dumas and Yanai Elazar and Valentin Hofmann and Ananya Harsh Jha and Sachin Kumar and Li Lucy and Xinxi Lyu and Nathan Lambert and Ian Magnusson and Jacob Morrison and Niklas Muennighoff and Aakanksha Naik and Crystal Nam and Matthew E. Peters and Abhilasha Ravichander and Kyle Richardson and Zejiang Shen and Emma Strubell and Nishant Subramani and Oyvind Tafjord and Pete Walsh and Luke Zettlemoyer and Noah A. Smith and Hannaneh Hajishirzi and Iz Beltagy and Dirk Groeneveld and Jesse Dodge and Kyle Lo},\n      year={2024},\n      eprint={2402.00159},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}