{
    "2310.03813": {
        "paper_id": "2310.03813",
        "abs_url": "https://arxiv.org/abs/2310.03813",
        "pdf_url": "https://arxiv.org/pdf/2310.03813.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2310.03813_Accurate_Cold-start_Bundle_Recommendation_via_Popularity-based_Coalescence_and_Curriculum_Heating.pdf",
        "title": "Accurate Cold-start Bundle Recommendation via Popularity-based Coalescence and Curriculum Heating",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Hyunsik Jeon",
            "Jong-eun Lee",
            "Jeongin Yun",
            "U Kang"
        ],
        "abstract": "How can we accurately recommend cold-start bundles to users? The cold-start problem in bundle recommendation is critical in practical scenarios since new bundles are continuously created for various marketing purposes. Despite its importance, no previous studies have addressed cold-start bundle recommendation. Moreover, existing methods for cold-start item recommendation overly rely on historical information, even for unpopular bundles, failing to tackle the primary challenge of the highly skewed distribution of bundle interactions. In this work, we propose CoHeat (Popularity-based Coalescence and Curriculum Heating), an accurate approach for the cold-start bundle recommendation. CoHeat tackles the highly skewed distribution of bundle interactions by incorporating both historical and affiliation information based on the bundle's popularity when estimating the user-bundle relationship. Furthermore, CoHeat effectively learns latent representations by exploiting curriculum learning and contrastive learning. CoHeat demonstrates superior performance in cold-start bundle recommendation, achieving up to 193% higher nDCG@20 compared to the best competitor.",
        "comments": "8 pages, 4 figures, 4 tables",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/accurate-cold-start-bundle-recommendation-via",
        "bibtex": "@misc{jeon2023accurate,\n      title={Accurate Cold-start Bundle Recommendation via Popularity-based Coalescence and Curriculum Heating}, \n      author={Hyunsik Jeon and Jong-eun Lee and Jeongin Yun and U Kang},\n      year={2023},\n      eprint={2310.03813},\n      archivePrefix={arXiv},\n      primaryClass={cs.IR}\n}"
    }
}