{
    "2404.03414v1": {
        "paper_id": "2404.03414v1",
        "abs_url": "https://arxiv.org/abs/2404.03414v1",
        "pdf_url": "https://arxiv.org/pdf/2404.03414v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.03414v1_Can_Small_Language_Models_Help_Large_Language_Models_Reason_Better?_LM-Guided_Chain-of-Thought.pdf",
        "title": "Can Small Language Models Help Large Language Models Reason Better?: LM-Guided Chain-of-Thought",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Jooyoung Lee",
            "Fan Yang",
            "Thanh Tran",
            "Qian Hu",
            "Emre Barut",
            "Kai-Wei Chang",
            "Chengwei Su"
        ],
        "abstract": "We introduce a novel framework, LM-Guided CoT, that leverages a lightweight (i.e., <1B) language model (LM) for guiding a black-box large (i.e., >10B) LM in reasoning tasks. Specifically, the lightweight LM first generates a rationale for each input instance. The Frozen large LM is then prompted to predict a task output based on the rationale generated by the lightweight LM. Our approach is resource-efficient in the sense that it only requires training the lightweight LM. We optimize the model through 1) knowledge distillation and 2) reinforcement learning from rationale-oriented and task-oriented reward signals. We assess our method with multi-hop extractive question answering (QA) benchmarks, HotpotQA, and 2WikiMultiHopQA. Experimental results show that our approach outperforms all baselines regarding answer prediction accuracy. We also find that reinforcement learning helps the model to produce higher-quality rationales with improved QA performance.",
        "comments": "This paper is accepted to LREC-COLING 2024",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/can-small-language-models-help-large-language",
        "bibtex": "@misc{lee2024small,\n      title={Can Small Language Models Help Large Language Models Reason Better?: LM-Guided Chain-of-Thought}, \n      author={Jooyoung Lee and Fan Yang and Thanh Tran and Qian Hu and Emre Barut and Kai-Wei Chang and Chengwei Su},\n      year={2024},\n      eprint={2404.03414},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}