{
    "2101.03961": {
        "paper_id": "2101.03961",
        "abs_url": "https://arxiv.org/abs/2101.03961",
        "pdf_url": "https://arxiv.org/pdf/2101.03961.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2101.03961_Switch_Transformers_Scaling_to_Trillion_Parameter_Models_with_Simple_and_Efficient_Sparsity.pdf",
        "title": "Switch Transformers: Scaling to Trillion Parameter Models with Simple and Efficient Sparsity",
        "year": null,
        "paper_venue": null,
        "authors": [
            "William Fedus",
            "Barret Zoph",
            "Noam Shazeer"
        ],
        "abstract": "In deep learning, models typically reuse the same parameters for all inputs. Mixture of Experts (MoE) defies this and instead selects different parameters for each incoming example. The result is a sparsely-activated model -- with outrageous numbers of parameters -- but a constant computational cost. However, despite several notable successes of MoE, widespread adoption has been hindered by complexity, communication costs and training instability -- we address these with the Switch Transformer. We simplify the MoE routing algorithm and design intuitive improved models with reduced communication and computational costs. Our proposed training techniques help wrangle the instabilities and we show large sparse models may be trained, for the first time, with lower precision (bfloat16) formats. We design models based off T5-Base and T5-Large to obtain up to 7x increases in pre-training speed with the same computational resources. These improvements extend into multilingual settings where we measure gains over the mT5-Base version across all 101 languages. Finally, we advance the current scale of language models by pre-training up to trillion parameter models on the \"Colossal Clean Crawled Corpus\" and achieve a 4x speedup over the T5-XXL model.",
        "comments": "JMLR",
        "official_code_urls": [
            "https://github.com/tensorflow/mesh"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/switch-transformers-scaling-to-trillion",
        "bibtex": "@misc{fedus2022switch,\n      title={Switch Transformers: Scaling to Trillion Parameter Models with Simple and Efficient Sparsity}, \n      author={William Fedus and Barret Zoph and Noam Shazeer},\n      year={2022},\n      eprint={2101.03961},\n      archivePrefix={arXiv},\n      primaryClass={cs.LG}\n}"
    }
}