{
    "2002.06563": {
        "paper_id": "2002.06563",
        "abs_url": "https://arxiv.org/abs/2002.06563",
        "pdf_url": "https://arxiv.org/pdf/2002.06563.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2002.06563_Epidemic_analysis_of_COVID-19_in_China_by_dynamical_modeling.pdf",
        "title": "Epidemic analysis of COVID-19 in China by dynamical modeling",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Liangrong Peng",
            "Wuyue Yang",
            "Dongyan Zhang",
            "Changjing Zhuge",
            "Liu Hong"
        ],
        "abstract": "The outbreak of novel coronavirus-caused pneumonia (COVID-19) in Wuhan has attracted worldwide attention. Here, we propose a generalized SEIR model to analyze this epidemic. Based on the public data of National Health Commission of China from Jan. 20th to Feb. 9th, 2020, we reliably estimate key epidemic parameters and make predictions on the inflection point and possible ending time for 5 different regions. According to optimistic estimation, the epidemics in Beijing and Shanghai will end soon within two weeks, while for most part of China, including the majority of cities in Hubei province, the success of anti-epidemic will be no later than the middle of March. The situation in Wuhan is still very severe, at least based on public data until Feb. 15th. We expect it will end up at the beginning of April. Moreover, by inverse inference, we find the outbreak of COVID-19 in Mainland, Hubei province and Wuhan all can be dated back to the end of December 2019, and the doubling time is around two days at the early stage.",
        "comments": "11 pages, 6 figures, 1 table",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/epidemic-analysis-of-covid-19-in-china-by",
        "bibtex": "@misc{peng2020epidemic,\n      title={Epidemic analysis of COVID-19 in China by dynamical modeling}, \n      author={Liangrong Peng and Wuyue Yang and Dongyan Zhang and Changjing Zhuge and Liu Hong},\n      year={2020},\n      eprint={2002.06563},\n      archivePrefix={arXiv},\n      primaryClass={q-bio.PE}\n}"
    }
}