{
    "2311.08545": {
        "paper_id": "2311.08545",
        "abs_url": "https://arxiv.org/abs/2311.08545",
        "pdf_url": "https://arxiv.org/pdf/2311.08545.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2311.08545_Efficient_Continual_Pre-training_for_Building_Domain_Specific_Large_Language_Models.pdf",
        "title": "Efficient Continual Pre-training for Building Domain Specific Large Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Yong Xie",
            "Karan Aggarwal",
            "Aitzaz Ahmad"
        ],
        "abstract": "Large language models (LLMs) have demonstrated remarkable open-domain capabilities. Traditionally, LLMs tailored for a domain are trained from scratch to excel at handling domain-specific tasks. In this work, we explore an alternative strategy of continual pre-training as a means to develop domain-specific LLMs. We introduce FinPythia-6.9B, developed through domain-adaptive continual pre-training on the financial domain. Continual pre-trained FinPythia showcases consistent improvements on financial tasks over the original foundational model. We further explore simple but effective data selection strategies for continual pre-training. Our data selection strategies outperforms vanilla continual pre-training's performance with just 10% of corpus size and cost, without any degradation on open-domain standard tasks. Our work proposes an alternative solution to building domain-specific LLMs from scratch in a cost-effective manner.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/efficient-continual-pre-training-for-building",
        "bibtex": "@misc{xie2023efficient,\n      title={Efficient Continual Pre-training for Building Domain Specific Large Language Models}, \n      author={Yong Xie and Karan Aggarwal and Aitzaz Ahmad},\n      year={2023},\n      eprint={2311.08545},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}