{
    "2402.14714v1": {
        "paper_id": "2402.14714v1",
        "abs_url": "https://arxiv.org/abs/2402.14714v1",
        "pdf_url": "https://arxiv.org/pdf/2402.14714v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.14714v1_Efficient_and_Effective_Vocabulary_Expansion_Towards_Multilingual_Large_Language_Models.pdf",
        "title": "Efficient and Effective Vocabulary Expansion Towards Multilingual Large Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Seungduk Kim",
            "Seungtaek Choi",
            "Myeongho Jeong"
        ],
        "abstract": "This report introduces \\texttt{EEVE-Korean-v1.0}, a Korean adaptation of large language models that exhibit remarkable capabilities across English and Korean text understanding. Building on recent highly capable but English-centric LLMs, such as SOLAR-10.7B and Phi-2, where non-English texts are inefficiently processed with English-centric tokenizers, we present an efficient and effective vocabulary expansion (EEVE) method, which encompasses parameter freezing and subword initialization. In contrast to previous efforts that believe new embeddings require trillions of training tokens, we show that our method can significantly boost non-English proficiency within just 2 billion tokens. Surpassing most instruction-tuned LLMs on the Open Ko-LLM Leaderboard, as of January 2024, our model \\texttt{EEVE-Korean-10.8B-v1.0} ranks as the leading Korean pre-trained model in the open-source community, according to Hugging Face's leaderboard. We open-source our models on Huggingface to empower the open research community in various languages.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/hiyouga/llama-factory"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/efficient-and-effective-vocabulary-expansion",
        "bibtex": "@misc{kim2024efficient,\n      title={Efficient and Effective Vocabulary Expansion Towards Multilingual Large Language Models}, \n      author={Seungduk Kim and Seungtaek Choi and Myeongho Jeong},\n      year={2024},\n      eprint={2402.14714},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}