{
    "2401.10020": {
        "paper_id": "2401.10020",
        "abs_url": "https://arxiv.org/abs/2401.10020",
        "pdf_url": "https://arxiv.org/pdf/2401.10020.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2401.10020_Self-Rewarding_Language_Models.pdf",
        "title": "Self-Rewarding Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Weizhe Yuan",
            "Richard Yuanzhe Pang",
            "Kyunghyun Cho",
            "Sainbayar Sukhbaatar",
            "Jing Xu",
            "Jason Weston"
        ],
        "abstract": "We posit that to achieve superhuman agents, future models require superhuman feedback in order to provide an adequate training signal. Current approaches commonly train reward models from human preferences, which may then be bottlenecked by human performance level, and secondly these separate frozen reward models cannot then learn to improve during LLM training. In this work, we study Self-Rewarding Language Models, where the language model itself is used via LLM-as-a-Judge prompting to provide its own rewards during training. We show that during Iterative DPO training that not only does instruction following ability improve, but also the ability to provide high-quality rewards to itself. Fine-tuning Llama 2 70B on three iterations of our approach yields a model that outperforms many existing systems on the AlpacaEval 2.0 leaderboard, including Claude 2, Gemini Pro, and GPT-4 0613. While only a preliminary study, this work opens the door to the possibility of models that can continually improve in both axes.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/self-rewarding-language-models",
        "bibtex": "@misc{yuan2024selfrewarding,\n      title={Self-Rewarding Language Models}, \n      author={Weizhe Yuan and Richard Yuanzhe Pang and Kyunghyun Cho and Sainbayar Sukhbaatar and Jing Xu and Jason Weston},\n      year={2024},\n      eprint={2401.10020},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}