{
    "2404.07965v1": {
        "paper_id": "2404.07965v1",
        "abs_url": "https://arxiv.org/abs/2404.07965v1",
        "pdf_url": "https://arxiv.org/pdf/2404.07965v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.07965v1_Rho-1_Not_All_Tokens_Are_What_You_Need.pdf",
        "title": "Rho-1: Not All Tokens Are What You Need",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Zhenghao Lin",
            "Zhibin Gou",
            "Yeyun Gong",
            "Xiao Liu",
            "Yelong Shen",
            "Ruochen Xu",
            "Chen Lin",
            "Yujiu Yang",
            "Jian Jiao",
            "Nan Duan",
            "Weizhu Chen"
        ],
        "abstract": "Previous language model pre-training methods have uniformly applied a next-token prediction loss to all training tokens. Challenging this norm, we posit that \"Not all tokens in a corpus are equally important for language model training\". Our initial analysis delves into token-level training dynamics of language model, revealing distinct loss patterns for different tokens. Leveraging these insights, we introduce a new language model called Rho-1. Unlike traditional LMs that learn to predict every next token in a corpus, Rho-1 employs Selective Language Modeling (SLM), which selectively trains on useful tokens that aligned with the desired distribution. This approach involves scoring pretraining tokens using a reference model, and then training the language model with a focused loss on tokens with higher excess loss. When continual pretraining on 15B OpenWebMath corpus, Rho-1 yields an absolute improvement in few-shot accuracy of up to 30% in 9 math tasks. After fine-tuning, Rho-1-1B and 7B achieved state-of-the-art results of 40.6% and 51.8% on MATH dataset, respectively - matching DeepSeekMath with only 3% of the pretraining tokens. Furthermore, when pretraining on 80B general tokens, Rho-1 achieves 6.8% average enhancement across 15 diverse tasks, increasing both efficiency and performance of the language model pre-training.",
        "comments": "First two authors equal contribution",
        "official_code_urls": [
            "https://github.com/microsoft/rho"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/rho-1-not-all-tokens-are-what-you-need",
        "bibtex": "@misc{lin2024rho1,\n      title={Rho-1: Not All Tokens Are What You Need}, \n      author={Zhenghao Lin and Zhibin Gou and Yeyun Gong and Xiao Liu and Yelong Shen and Ruochen Xu and Chen Lin and Yujiu Yang and Jian Jiao and Nan Duan and Weizhu Chen},\n      year={2024},\n      eprint={2404.07965},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}