{
    "2312.06585": {
        "paper_id": "2312.06585",
        "abs_url": "https://arxiv.org/abs/2312.06585",
        "pdf_url": "https://arxiv.org/pdf/2312.06585.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2312.06585_Beyond_Human_Data_Scaling_Self-Training_for_Problem-Solving_with_Language_Models.pdf",
        "title": "Beyond Human Data: Scaling Self-Training for Problem-Solving with Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Avi Singh",
            "John D. Co-Reyes",
            "Rishabh Agarwal",
            "Ankesh Anand",
            "Piyush Patil",
            "Peter J. Liu",
            "James Harrison",
            "Jaehoon Lee",
            "Kelvin Xu",
            "Aaron Parisi",
            "Abhishek Kumar",
            "Alex Alemi",
            "Alex Rizkowsky",
            "Azade Nova",
            "Ben Adlam",
            "Bernd Bohnet",
            "Gamaleldin Elsayed",
            "Hanie Sedghi",
            "Igor Mordatch",
            "Isabelle Simpson",
            "Izzeddin Gur",
            "Jasper Snoek",
            "Jeffrey Pennington",
            "Jiri Hron",
            "Kathleen Kenealy",
            "Kevin Swersky",
            "Kshiteej Mahajan",
            "Laura Culp",
            "Lechao Xiao",
            "Maxwell L. Bileschi",
            "Noah Constant",
            "Roman Novak",
            "Rosanne Liu",
            "Tris Warkentin",
            "Yundi Qian",
            "Ethan Dyer",
            "Behnam Neyshabur",
            "Jascha Sohl-Dickstein",
            "Noah Fiedel"
        ],
        "abstract": "Fine-tuning language models~(LMs) on human-generated data remains a prevalent practice. However, the performance of such models is often limited by the quantity and diversity of high-quality human data. In this paper, we explore whether we can go beyond human data on tasks where we have access to scalar feedback, for example, on math problems where one can verify correctness. To do so, we investigate a simple self-training method based on expectation-maximization, which we call ReST$^{EM}$, where we (1) generate samples from the model and filter them using binary feedback, (2) fine-tune the model on these samples, and (3) repeat this process a few times. Testing on advanced MATH reasoning and APPS coding benchmarks using PaLM-2 models, we find that ReST$^{EM}$ scales favorably with model size and significantly surpasses fine-tuning only on human data. Overall, our findings suggest self-training with feedback can substantially reduce dependence on human-generated data.",
        "comments": "First three authors contributed equally",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/beyond-human-data-scaling-self-training-for",
        "bibtex": "@misc{singh2023human,\n      title={Beyond Human Data: Scaling Self-Training for Problem-Solving with Language Models}, \n      author={Avi Singh and John D. Co-Reyes and Rishabh Agarwal and Ankesh Anand and Piyush Patil and Peter J. Liu and James Harrison and Jaehoon Lee and Kelvin Xu and Aaron Parisi and Abhishek Kumar and Alex Alemi and Alex Rizkowsky and Azade Nova and Ben Adlam and Bernd Bohnet and Gamaleldin Elsayed and Hanie Sedghi and Igor Mordatch and Isabelle Simpson and Izzeddin Gur and Jasper Snoek and Jeffrey Pennington and Jiri Hron and Kathleen Kenealy and Kevin Swersky and Kshiteej Mahajan and Laura Culp and Lechao Xiao and Maxwell L. Bileschi and Noah Constant and Roman Novak and Rosanne Liu and Tris Warkentin and Yundi Qian and Ethan Dyer and Behnam Neyshabur and Jascha Sohl-Dickstein and Noah Fiedel},\n      year={2023},\n      eprint={2312.06585},\n      archivePrefix={arXiv},\n      primaryClass={cs.LG}\n}"
    }
}