{
    "2403.04652v1": {
        "paper_id": "2403.04652v1",
        "abs_url": "https://arxiv.org/abs/2403.04652v1",
        "pdf_url": "https://arxiv.org/pdf/2403.04652v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2403.04652v1_Yi_Open_Foundation_Models_by_01AI.pdf",
        "title": "Yi: Open Foundation Models by 01.AI",
        "year": null,
        "paper_venue": null,
        "authors": [
            "01.AI",
            ":",
            "Alex Young",
            "Bei Chen",
            "Chao Li",
            "Chengen Huang",
            "Ge Zhang",
            "Guanwei Zhang",
            "Heng Li",
            "Jiangcheng Zhu",
            "Jianqun Chen",
            "Jing Chang",
            "Kaidong Yu",
            "Peng Liu",
            "Qiang Liu",
            "Shawn Yue",
            "Senbin Yang",
            "Shiming Yang",
            "Tao Yu",
            "Wen Xie",
            "Wenhao Huang",
            "Xiaohui Hu",
            "Xiaoyi Ren",
            "Xinyao Niu",
            "Pengcheng Nie",
            "Yuchi Xu",
            "Yudong Liu",
            "Yue Wang",
            "Yuxuan Cai",
            "Zhenyu Gu",
            "Zhiyuan Liu",
            "Zonghong Dai"
        ],
        "abstract": "We introduce the Yi model family, a series of language and multimodal models that demonstrate strong multi-dimensional capabilities. The Yi model family is based on 6B and 34B pretrained language models, then we extend them to chat models, 200K long context models, depth-upscaled models, and vision-language models. Our base models achieve strong performance on a wide range of benchmarks like MMLU, and our finetuned chat models deliver strong human preference rate on major evaluation platforms like AlpacaEval and Chatbot Arena. Building upon our scalable super-computing infrastructure and the classical transformer architecture, we attribute the performance of Yi models primarily to its data quality resulting from our data-engineering efforts. For pretraining, we construct 3.1 trillion tokens of English and Chinese corpora using a cascaded data deduplication and quality filtering pipeline. For finetuning, we polish a small scale (less than 10K) instruction dataset over multiple iterations such that every single instance has been verified directly by our machine learning engineers. For vision-language, we combine the chat language model with a vision transformer encoder and train the model to align visual representations to the semantic space of the language model. We further extend the context length to 200K through lightweight continual pretraining and demonstrate strong needle-in-a-haystack retrieval performance. We show that extending the depth of the pretrained checkpoint through continual pretraining further improves performance. We believe that given our current results, continuing to scale up model parameters using thoroughly optimized data will lead to even stronger frontier models.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/01-ai/yi"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/yi-open-foundation-models-by-01-ai",
        "bibtex": "@misc{ai2024yi,\n      title={Yi: Open Foundation Models by 01.AI}, \n      author={01. AI and : and Alex Young and Bei Chen and Chao Li and Chengen Huang and Ge Zhang and Guanwei Zhang and Heng Li and Jiangcheng Zhu and Jianqun Chen and Jing Chang and Kaidong Yu and Peng Liu and Qiang Liu and Shawn Yue and Senbin Yang and Shiming Yang and Tao Yu and Wen Xie and Wenhao Huang and Xiaohui Hu and Xiaoyi Ren and Xinyao Niu and Pengcheng Nie and Yuchi Xu and Yudong Liu and Yue Wang and Yuxuan Cai and Zhenyu Gu and Zhiyuan Liu and Zonghong Dai},\n      year={2024},\n      eprint={2403.04652},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}