{
    "2403.16952v1": {
        "paper_id": "2403.16952v1",
        "abs_url": "https://arxiv.org/abs/2403.16952v1",
        "pdf_url": "https://arxiv.org/pdf/2403.16952v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2403.16952v1_Data_Mixing_Laws_Optimizing_Data_Mixtures_by_Predicting_Language_Modeling_Performance.pdf",
        "title": "Data Mixing Laws: Optimizing Data Mixtures by Predicting Language Modeling Performance",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Jiasheng Ye",
            "Peiju Liu",
            "Tianxiang Sun",
            "Yunhua Zhou",
            "Jun Zhan",
            "Xipeng Qiu"
        ],
        "abstract": "Pretraining data of large language models composes multiple domains (e.g., web texts, academic papers, codes), whose mixture proportions crucially impact the competence of outcome models. While existing endeavors rely on heuristics or qualitative strategies to tune the proportions, we discover the quantitative predictability of model performance regarding the mixture proportions in function forms, which we refer to as the data mixing laws. Fitting such functions on sample mixtures unveils model performance on unseen mixtures before actual runs, thus guiding the selection of an ideal data mixture. Furthermore, we propose nested use of the scaling laws of training steps, model sizes, and our data mixing law to enable predicting the performance of large models trained on massive data under various mixtures with only small-scale training. Moreover, experimental results verify that our method effectively optimizes the training mixture of a 1B model trained for 100B tokens in RedPajama, reaching a performance comparable to the one trained for 48% more steps on the default mixture. Extending the application of data mixing laws to continual training accurately predicts the critical mixture proportion that avoids catastrophic forgetting and outlooks the potential for dynamic data schedules",
        "comments": "",
        "official_code_urls": [
            "https://github.com/yegcjs/mixinglaws"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/data-mixing-laws-optimizing-data-mixtures-by",
        "bibtex": "@misc{ye2024data,\n      title={Data Mixing Laws: Optimizing Data Mixtures by Predicting Language Modeling Performance}, \n      author={Jiasheng Ye and Peiju Liu and Tianxiang Sun and Yunhua Zhou and Jun Zhan and Xipeng Qiu},\n      year={2024},\n      eprint={2403.16952},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}