{
    "2404.07647v1": {
        "paper_id": "2404.07647v1",
        "abs_url": "https://arxiv.org/abs/2404.07647v1",
        "pdf_url": "https://arxiv.org/pdf/2404.07647v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.07647v1_Why_do_small_language_models_underperform?_Studying_Language_Model_Saturation_via_the_Softmax_Bottleneck.pdf",
        "title": "Why do small language models underperform? Studying Language Model Saturation via the Softmax Bottleneck",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Nathan Godey",
            "Éric de la Clergerie",
            "Benoît Sagot"
        ],
        "abstract": "Recent advances in language modeling consist in pretraining highly parameterized neural networks on extremely large web-mined text corpora. Training and inference with such models can be costly in practice, which incentivizes the use of smaller counterparts. However, it has been observed that smaller models can suffer from saturation, characterized as a drop in performance at some advanced point in training followed by a plateau. In this paper, we find that such saturation can be explained by a mismatch between the hidden dimension of smaller models and the high rank of the target contextual probability distribution. This mismatch affects the performance of the linear prediction head used in such models through the well-known softmax bottleneck phenomenon. We measure the effect of the softmax bottleneck in various settings and find that models based on less than 1000 hidden dimensions tend to adopt degenerate latent representations in late pretraining, which leads to reduced evaluation performance.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/why-do-small-language-models-underperform",
        "bibtex": "@misc{godey2024small,\n      title={Why do small language models underperform? Studying Language Model Saturation via the Softmax Bottleneck}, \n      author={Nathan Godey and Éric de la Clergerie and Benoît Sagot},\n      year={2024},\n      eprint={2404.07647},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}