{
    "2305.18290v2": {
        "paper_id": "2305.18290v2",
        "abs_url": "https://arxiv.org/abs/2305.18290v2",
        "pdf_url": "https://arxiv.org/pdf/2305.18290v2.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2305.18290v2_Direct_Preference_Optimization_Your_Language_Model_is_Secretly_a_Reward_Model.pdf",
        "title": "Direct Preference Optimization: Your Language Model is Secretly a Reward Model",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Rafael Rafailov",
            "Archit Sharma",
            "Eric Mitchell",
            "Stefano Ermon",
            "Christopher D. Manning",
            "Chelsea Finn"
        ],
        "abstract": "While large-scale unsupervised language models (LMs) learn broad world knowledge and some reasoning skills, achieving precise control of their behavior is difficult due to the completely unsupervised nature of their training. Existing methods for gaining such steerability collect human labels of the relative quality of model generations and fine-tune the unsupervised LM to align with these preferences, often with reinforcement learning from human feedback (RLHF). However, RLHF is a complex and often unstable procedure, first fitting a reward model that reflects the human preferences, and then fine-tuning the large unsupervised LM using reinforcement learning to maximize this estimated reward without drifting too far from the original model. In this paper we introduce a new parameterization of the reward model in RLHF that enables extraction of the corresponding optimal policy in closed form, allowing us to solve the standard RLHF problem with only a simple classification loss. The resulting algorithm, which we call Direct Preference Optimization (DPO), is stable, performant, and computationally lightweight, eliminating the need for sampling from the LM during fine-tuning or performing significant hyperparameter tuning. Our experiments show that DPO can fine-tune LMs to align with human preferences as well as or better than existing methods. Notably, fine-tuning with DPO exceeds PPO-based RLHF in ability to control sentiment of generations, and matches or improves response quality in summarization and single-turn dialogue while being substantially simpler to implement and train.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/direct-preference-optimization-your-language",
        "bibtex": "@misc{rafailov2023direct,\n      title={Direct Preference Optimization: Your Language Model is Secretly a Reward Model}, \n      author={Rafael Rafailov and Archit Sharma and Eric Mitchell and Stefano Ermon and Christopher D. Manning and Chelsea Finn},\n      year={2023},\n      eprint={2305.18290},\n      archivePrefix={arXiv},\n      primaryClass={cs.LG}\n}"
    }
}