{
    "2404.14219v1": {
        "paper_id": "2404.14219v1",
        "abs_url": "https://arxiv.org/abs/2404.14219v1",
        "pdf_url": "https://arxiv.org/pdf/2404.14219v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2404.14219v1_Phi-3_Technical_Report_A_Highly_Capable_Language_Model_Locally_on_Your_Phone.pdf",
        "title": "Phi-3 Technical Report: A Highly Capable Language Model Locally on Your Phone",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Marah Abdin",
            "Sam Ade Jacobs",
            "Ammar Ahmad Awan",
            "Jyoti Aneja",
            "Ahmed Awadallah",
            "Hany Awadalla",
            "Nguyen Bach",
            "Amit Bahree",
            "Arash Bakhtiari",
            "Harkirat Behl",
            "Alon Benhaim",
            "Misha Bilenko",
            "Johan Bjorck",
            "Sébastien Bubeck",
            "Martin Cai",
            "Caio César Teodoro Mendes",
            "Weizhu Chen",
            "Vishrav Chaudhary",
            "Parul Chopra",
            "Allie Del Giorno",
            "Gustavo de Rosa",
            "Matthew Dixon",
            "Ronen Eldan",
            "Dan Iter",
            "Abhishek Goswami",
            "Suriya Gunasekar",
            "Emman Haider",
            "Junheng Hao",
            "Russell J. Hewett",
            "Jamie Huynh",
            "Mojan Javaheripi",
            "Xin Jin",
            "Piero Kauffmann",
            "Nikos Karampatziakis",
            "Dongwoo Kim",
            "Mahoud Khademi",
            "Lev Kurilenko",
            "James R. Lee",
            "Yin Tat Lee",
            "Yuanzhi Li",
            "Chen Liang",
            "Weishung Liu",
            "Eric Lin",
            "Zeqi Lin",
            "Piyush Madan",
            "Arindam Mitra",
            "Hardik Modi",
            "Anh Nguyen",
            "Brandon Norick",
            "Barun Patra",
            "Daniel Perez-Becker",
            "Thomas Portet",
            "Reid Pryzant",
            "Heyang Qin",
            "Marko Radmilac",
            "Corby Rosset",
            "Sambudha Roy",
            "Olli Saarikivi",
            "Amin Saied",
            "Adil Salim",
            "Michael Santacroce",
            "Shital Shah",
            "Ning Shang",
            "Hiteshi Sharma",
            "Xia Song",
            "Olatunji Ruwase",
            "Xin Wang",
            "Rachel Ward",
            "Guanhua Wang",
            "Philipp Witte",
            "Michael Wyatt",
            "Can Xu",
            "Jiahang Xu",
            "Sonali Yadav",
            "Fan Yang",
            "Ziyi Yang",
            "Donghan Yu",
            "Chengruidong Zhang",
            "Cyril Zhang",
            "Jianwen Zhang",
            "Li Lyna Zhang",
            "Yi Zhang",
            "Yunan Zhang",
            "Xiren Zhou"
        ],
        "abstract": "We introduce phi-3-mini, a 3.8 billion parameter language model trained on 3.3 trillion tokens, whose overall performance, as measured by both academic benchmarks and internal testing, rivals that of models such as Mixtral 8x7B and GPT-3.5 (e.g., phi-3-mini achieves 69% on MMLU and 8.38 on MT-bench), despite being small enough to be deployed on a phone. The innovation lies entirely in our dataset for training, a scaled-up version of the one used for phi-2, composed of heavily filtered web data and synthetic data. The model is also further aligned for robustness, safety, and chat format. We also provide some initial parameter-scaling results with a 7B and 14B models trained for 4.8T tokens, called phi-3-small and phi-3-medium, both significantly more capable than phi-3-mini (e.g., respectively 75% and 78% on MMLU, and 8.7 and 8.9 on MT-bench).",
        "comments": "12 pages",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/phi-3-technical-report-a-highly-capable",
        "bibtex": "@misc{abdin2024phi3,\n      title={Phi-3 Technical Report: A Highly Capable Language Model Locally on Your Phone}, \n      author={Marah Abdin and Sam Ade Jacobs and Ammar Ahmad Awan and Jyoti Aneja and Ahmed Awadallah and Hany Awadalla and Nguyen Bach and Amit Bahree and Arash Bakhtiari and Harkirat Behl and Alon Benhaim and Misha Bilenko and Johan Bjorck and Sébastien Bubeck and Martin Cai and Caio César Teodoro Mendes and Weizhu Chen and Vishrav Chaudhary and Parul Chopra and Allie Del Giorno and Gustavo de Rosa and Matthew Dixon and Ronen Eldan and Dan Iter and Abhishek Goswami and Suriya Gunasekar and Emman Haider and Junheng Hao and Russell J. Hewett and Jamie Huynh and Mojan Javaheripi and Xin Jin and Piero Kauffmann and Nikos Karampatziakis and Dongwoo Kim and Mahoud Khademi and Lev Kurilenko and James R. Lee and Yin Tat Lee and Yuanzhi Li and Chen Liang and Weishung Liu and Eric Lin and Zeqi Lin and Piyush Madan and Arindam Mitra and Hardik Modi and Anh Nguyen and Brandon Norick and Barun Patra and Daniel Perez-Becker and Thomas Portet and Reid Pryzant and Heyang Qin and Marko Radmilac and Corby Rosset and Sambudha Roy and Olli Saarikivi and Amin Saied and Adil Salim and Michael Santacroce and Shital Shah and Ning Shang and Hiteshi Sharma and Xia Song and Olatunji Ruwase and Xin Wang and Rachel Ward and Guanhua Wang and Philipp Witte and Michael Wyatt and Can Xu and Jiahang Xu and Sonali Yadav and Fan Yang and Ziyi Yang and Donghan Yu and Chengruidong Zhang and Cyril Zhang and Jianwen Zhang and Li Lyna Zhang and Yi Zhang and Yunan Zhang and Xiren Zhou},\n      year={2024},\n      eprint={2404.14219},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}