{
    "2402.08939v1": {
        "paper_id": "2402.08939v1",
        "abs_url": "https://arxiv.org/abs/2402.08939v1",
        "pdf_url": "https://arxiv.org/pdf/2402.08939v1.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.08939v1_Premise_Order_Matters_in_Reasoning_with_Large_Language_Models.pdf",
        "title": "Premise Order Matters in Reasoning with Large Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Xinyun Chen",
            "Ryan A. Chi",
            "Xuezhi Wang",
            "Denny Zhou"
        ],
        "abstract": "Large language models (LLMs) have accomplished remarkable reasoning performance in various domains. However, in the domain of reasoning tasks, we discover a frailty: LLMs are surprisingly brittle to the ordering of the premises, despite the fact that such ordering does not alter the underlying task. In particular, we observe that LLMs achieve the best performance when the premise order aligns with the context required in intermediate reasoning steps. For example, in deductive reasoning tasks, presenting the premises in the same order as the ground truth proof in the prompt (as opposed to random ordering) drastically increases the model's accuracy. We first examine the effect of premise ordering on deductive reasoning on a variety of LLMs, and our evaluation shows that permuting the premise order can cause a performance drop of over 30%. In addition, we release the benchmark R-GSM, based on GSM8K, to examine the ordering effect for mathematical problem-solving, and we again observe a significant drop in accuracy, relative to the original GSM8K benchmark.",
        "comments": "Xinyun and Ryan contribute equally",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/premise-order-matters-in-reasoning-with-large",
        "bibtex": "@misc{chen2024premise,\n      title={Premise Order Matters in Reasoning with Large Language Models}, \n      author={Xinyun Chen and Ryan A. Chi and Xuezhi Wang and Denny Zhou},\n      year={2024},\n      eprint={2402.08939},\n      archivePrefix={arXiv},\n      primaryClass={cs.AI}\n}"
    }
}