{
    "2309.15402": {
        "paper_id": "2309.15402",
        "abs_url": "https://arxiv.org/abs/2309.15402",
        "pdf_url": "https://arxiv.org/pdf/2309.15402.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2309.15402_A_Survey_of_Chain_of_Thought_Reasoning_Advances_Frontiers_and_Future.pdf",
        "title": "A Survey of Chain of Thought Reasoning: Advances, Frontiers and Future",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Zheng Chu",
            "Jingchang Chen",
            "Qianglong Chen",
            "Weijiang Yu",
            "Tao He",
            "Haotian Wang",
            "Weihua Peng",
            "Ming Liu",
            "Bing Qin",
            "Ting Liu"
        ],
        "abstract": "Chain-of-thought reasoning, a cognitive process fundamental to human intelligence, has garnered significant attention in the realm of artificial intelligence and natural language processing. However, there still remains a lack of a comprehensive survey for this arena. To this end, we take the first step and present a thorough survey of this research field carefully and widely. We use X-of-Thought to refer to Chain-of-Thought in a broad sense. In detail, we systematically organize the current research according to the taxonomies of methods, including XoT construction, XoT structure variants, and enhanced XoT. Additionally, we describe XoT with frontier applications, covering planning, tool use, and distillation. Furthermore, we address challenges and discuss some future directions, including faithfulness, multi-modal, and theory. We hope this survey serves as a valuable resource for researchers seeking to innovate within the domain of chain-of-thought reasoning.",
        "comments": "26 pages. Resources are available at this https URL",
        "official_code_urls": [
            "https://github.com/zchuz/cot-reasoning-survey"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/a-survey-of-chain-of-thought-reasoning",
        "bibtex": "@misc{chu2023survey,\n      title={A Survey of Chain of Thought Reasoning: Advances, Frontiers and Future}, \n      author={Zheng Chu and Jingchang Chen and Qianglong Chen and Weijiang Yu and Tao He and Haotian Wang and Weihua Peng and Ming Liu and Bing Qin and Ting Liu},\n      year={2023},\n      eprint={2309.15402},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}