{
    "1910.07099": {
        "paper_id": "1910.07099",
        "abs_url": "https://arxiv.org/abs/1910.07099",
        "pdf_url": "https://arxiv.org/pdf/1910.07099.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "1910.07099_Entire_Space_Multi-Task_Modeling_via_Post-Click_Behavior_Decomposition_for_Conversion_Rate_Prediction.pdf",
        "title": "Entire Space Multi-Task Modeling via Post-Click Behavior Decomposition for Conversion Rate Prediction",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Hong Wen",
            "Jing Zhang",
            "Yuan Wang",
            "Fuyu Lv",
            "Wentian Bao",
            "Quan Lin",
            "Keping Yang"
        ],
        "abstract": "Recommender system, as an essential part of modern e-commerce, consists of two fundamental modules, namely Click-Through Rate (CTR) and Conversion Rate (CVR) prediction. While CVR has a direct impact on the purchasing volume, its prediction is well-known challenging due to the Sample Selection Bias (SSB) and Data Sparsity (DS) issues. Although existing methods, typically built on the user sequential behavior path ``impression$\\to$click$\\to$purchase'', is effective for dealing with SSB issue, they still struggle to address the DS issue due to rare purchase training samples. Observing that users always take several purchase-related actions after clicking, we propose a novel idea of post-click behavior decomposition. Specifically, disjoint purchase-related Deterministic Action (DAction) and Other Action (OAction) are inserted between click and purchase in parallel, forming a novel user sequential behavior graph ``impression$\\to$click$\\to$D(O)Action$\\to$purchase''. Defining model on this graph enables to leverage all the impression samples over the entire space and extra abundant supervised signals from D(O)Action, which will effectively address the SSB and DS issues together. To this end, we devise a novel deep recommendation model named Elaborated Entire Space Supervised Multi-task Model ($ESM^{2}$). According to the conditional probability rule defined on the graph, it employs multi-task learning to predict some decomposed sub-targets in parallel and compose them sequentially to formulate the final CVR. Extensive experiments on both offline and online environments demonstrate the superiority of $ESM^{2}$ over state-of-the-art models. The source code and dataset will be released.",
        "comments": "10page, 7 figures. Accepted by SIGIR 2020. The source code will be released at this https URL",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/conversion-rate-prediction-via-post-click",
        "bibtex": "@misc{wen2020entire,\n      title={Entire Space Multi-Task Modeling via Post-Click Behavior Decomposition for Conversion Rate Prediction}, \n      author={Hong Wen and Jing Zhang and Yuan Wang and Fuyu Lv and Wentian Bao and Quan Lin and Keping Yang},\n      year={2020},\n      eprint={1910.07099},\n      archivePrefix={arXiv},\n      primaryClass={cs.LG}\n}"
    }
}