{
    "2112.02300": {
        "paper_id": "2112.02300",
        "abs_url": "https://arxiv.org/abs/2112.02300",
        "pdf_url": "https://arxiv.org/pdf/2112.02300.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2112.02300_Unsupervised_Domain_Generalization_by_Learning_a_Bridge_Across_Domains.pdf",
        "title": "Unsupervised Domain Generalization by Learning a Bridge Across Domains",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Sivan Harary",
            "Eli Schwartz",
            "Assaf Arbelle",
            "Peter Staar",
            "Shady Abu-Hussein",
            "Elad Amrani",
            "Roei Herzig",
            "Amit Alfassy",
            "Raja Giryes",
            "Hilde Kuehne",
            "Dina Katabi",
            "Kate Saenko",
            "Rogerio Feris",
            "Leonid Karlinsky"
        ],
        "abstract": "The ability to generalize learned representations across significantly different visual domains, such as between real photos, clipart, paintings, and sketches, is a fundamental capacity of the human visual system. In this paper, different from most cross-domain works that utilize some (or full) source domain supervision, we approach a relatively new and very practical Unsupervised Domain Generalization (UDG) setup of having no training supervision in neither source nor target domains. Our approach is based on self-supervised learning of a Bridge Across Domains (BrAD) - an auxiliary bridge domain accompanied by a set of semantics preserving visual (image-to-image) mappings to BrAD from each of the training domains. The BrAD and mappings to it are learned jointly (end-to-end) with a contrastive self-supervised representation model that semantically aligns each of the domains to its BrAD-projection, and hence implicitly drives all the domains (seen or unseen) to semantically align to each other. In this work, we show how using an edge-regularized BrAD our approach achieves significant gains across multiple benchmarks and a range of tasks, including UDG, Few-shot UDA, and unsupervised generalization across multi-domain datasets (including generalization to unseen domains and classes).",
        "comments": "",
        "official_code_urls": [
            "https://github.com/leokarlin/brad"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/unsupervised-domain-generalization-by",
        "bibtex": "@misc{harary2022unsupervised,\n      title={Unsupervised Domain Generalization by Learning a Bridge Across Domains}, \n      author={Sivan Harary and Eli Schwartz and Assaf Arbelle and Peter Staar and Shady Abu-Hussein and Elad Amrani and Roei Herzig and Amit Alfassy and Raja Giryes and Hilde Kuehne and Dina Katabi and Kate Saenko and Rogerio Feris and Leonid Karlinsky},\n      year={2022},\n      eprint={2112.02300},\n      archivePrefix={arXiv},\n      primaryClass={cs.CV}\n}"
    }
}