{
    "2212.09147": {
        "paper_id": "2212.09147",
        "abs_url": "https://arxiv.org/abs/2212.09147",
        "pdf_url": "https://arxiv.org/pdf/2212.09147.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2212.09147_Achiral_dielectric_metasurfaces_for_spectral_and_polarization_control_of_valley_specific_light_emission_from_monolayer_MoS2.pdf",
        "title": "Achiral dielectric metasurfaces for spectral and polarization control of valley specific light emission from monolayer MoS2",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Yin Liu",
            "Sze Cheung Lau",
            "Wen-Hui Sophia Cheng",
            "Amalya Johnson",
            "Qitong Li",
            "Emma Simmerman",
            "Ouri Karni",
            "Jack Hu",
            "Fang Liu",
            "Mark L. Brongersma",
            "Tony F. Heinz",
            "Jennifer A. Dionne"
        ],
        "abstract": "Excitons in two-dimensional transition metal dichalcogenides have a valley degree of freedom that can be optically accessed and manipulated for quantum information processing. Here, we integrate MoS2 with achiral silicon disk array metasurfaces to enhance and control valley-specific absorption and emission. Through the coupling to the metasurface Mie modes, the intensity and lifetime of the emission of neutral excitons, trions and defect bound excitons can be enhanced, while the spectral shape can be modified. Additionally, we demonstrate the symmetric enhancement of the degree-of-polarization (DOP) of neutral exciton and trions via valley-resolved PL measurements, and find that the DOP can be as high as 24% for exciton emission and 34% for trion emission at 100K. These results can be understood by analyzing the near-field impact of metasurface resonators on both the chiral absorption of MoS2 emitters as well as the enhanced emission from the Purcell effect. Combining Si-compatible photonic design with large-scale (mm-scale) 2D materials integration, our work makes an important step towards on-chip valleytronic applications approaching room-temperature operation.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/achiral-dielectric-metasurfaces-for-spectral",
        "bibtex": "@misc{liu2023achiral,\n      title={Achiral dielectric metasurfaces for spectral and polarization control of valley specific light emission from monolayer MoS2}, \n      author={Yin Liu and Sze Cheung Lau and Wen-Hui Sophia Cheng and Amalya Johnson and Qitong Li and Emma Simmerman and Ouri Karni and Jack Hu and Fang Liu and Mark L. Brongersma and Tony F. Heinz and Jennifer A. Dionne},\n      year={2023},\n      eprint={2212.09147},\n      archivePrefix={arXiv},\n      primaryClass={physics.optics}\n}"
    }
}