{
    "2311.16867": {
        "paper_id": "2311.16867",
        "abs_url": "https://arxiv.org/abs/2311.16867",
        "pdf_url": "https://arxiv.org/pdf/2311.16867.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2311.16867_The_Falcon_Series_of_Open_Language_Models.pdf",
        "title": "The Falcon Series of Open Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Ebtesam Almazrouei",
            "Hamza Alobeidli",
            "Abdulaziz Alshamsi",
            "Alessandro Cappelli",
            "Ruxandra Cojocaru",
            "Mérouane Debbah",
            "Étienne Goffinet",
            "Daniel Hesslow",
            "Julien Launay",
            "Quentin Malartic",
            "Daniele Mazzotta",
            "Badreddine Noune",
            "Baptiste Pannier",
            "Guilherme Penedo"
        ],
        "abstract": "We introduce the Falcon series: 7B, 40B, and 180B parameters causal decoder-only models trained on a diverse high-quality corpora predominantly assembled from web data. The largest model, Falcon-180B, has been trained on over 3.5 trillion tokens of text--the largest openly documented pretraining run. Falcon-180B significantly outperforms models such as PaLM or Chinchilla, and improves upon concurrently developed models such as LLaMA 2 or Inflection-1. It nears the performance of PaLM-2-Large at a reduced pretraining and inference cost, making it, to our knowledge, one of the three best language models in the world along with GPT-4 and PaLM-2-Large. We report detailed evaluations, as well as a deep dive into the methods and custom tooling employed to pretrain Falcon. Notably, we report on our custom distributed training codebase, allowing us to efficiently pretrain these models on up to 4,096 A100s on cloud AWS infrastructure with limited interconnect. We release a 600B tokens extract of our web dataset, as well as the Falcon-7/40/180B models under a permissive license to foster open-science and accelerate the development of an open ecosystem of large language models.",
        "comments": "",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/the-falcon-series-of-open-language-models",
        "bibtex": "@misc{almazrouei2023falcon,\n      title={The Falcon Series of Open Language Models}, \n      author={Ebtesam Almazrouei and Hamza Alobeidli and Abdulaziz Alshamsi and Alessandro Cappelli and Ruxandra Cojocaru and Mérouane Debbah and Étienne Goffinet and Daniel Hesslow and Julien Launay and Quentin Malartic and Daniele Mazzotta and Badreddine Noune and Baptiste Pannier and Guilherme Penedo},\n      year={2023},\n      eprint={2311.16867},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}