{
    "2312.01454": {
        "paper_id": "2312.01454",
        "abs_url": "https://arxiv.org/abs/2312.01454",
        "pdf_url": "https://arxiv.org/pdf/2312.01454.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2312.01454_D-Bot_Database_Diagnosis_System_using_Large_Language_Models.pdf",
        "title": "D-Bot: Database Diagnosis System using Large Language Models",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Xuanhe Zhou",
            "Guoliang Li",
            "Zhaoyan Sun",
            "Zhiyuan Liu",
            "Weize Chen",
            "Jianming Wu",
            "Jiesi Liu",
            "Ruohang Feng",
            "Guoyang Zeng"
        ],
        "abstract": "Database administrators (DBAs) play an important role in managing, maintaining and optimizing database systems. However, it is hard and tedious for DBAs to manage a large number of databases and give timely response (waiting for hours is intolerable in many online cases). In addition, existing empirical methods only support limited diagnosis scenarios, which are also labor-intensive to update the diagnosis rules for database version updates. Recently large language models (LLMs) have shown great potential in various fields. Thus, we propose D-Bot, an LLM-based database diagnosis system that can automatically acquire knowledge from diagnosis documents, and generate reasonable and well-founded diagnosis report (i.e., identifying the root causes and solutions) within acceptable time (e.g., under 10 minutes compared to hours by a DBA). The techniques in D-Bot include (i) offline knowledge extraction from documents, (ii) automatic prompt generation (e.g., knowledge matching, tool retrieval), (iii) root cause analysis using tree search algorithm, and (iv) collaborative mechanism for complex anomalies with multiple root causes. We verify D-Bot on real benchmarks (including 539 anomalies of six typical applications), and the results show that D-Bot can effectively analyze the root causes of unseen anomalies and significantly outperforms traditional methods and vanilla models like GPT-4.",
        "comments": "",
        "official_code_urls": [
            "https://github.com/tsinghuadatabasegroup/db-gpt"
        ],
        "pwc_page_url": "https://paperswithcode.com/paper/d-bot-database-diagnosis-system-using-large",
        "bibtex": "@misc{zhou2023dbot,\n      title={D-Bot: Database Diagnosis System using Large Language Models}, \n      author={Xuanhe Zhou and Guoliang Li and Zhaoyan Sun and Zhiyuan Liu and Weize Chen and Jianming Wu and Jiesi Liu and Ruohang Feng and Guoyang Zeng},\n      year={2023},\n      eprint={2312.01454},\n      archivePrefix={arXiv},\n      primaryClass={cs.DB}\n}"
    }
}