{
    "2402.06196v2": {
        "paper_id": "2402.06196v2",
        "abs_url": "https://arxiv.org/abs/2402.06196v2",
        "pdf_url": "https://arxiv.org/pdf/2402.06196v2.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "2402.06196v2_Large_Language_Models_A_Survey.pdf",
        "title": "Large Language Models: A Survey",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Shervin Minaee",
            "Tomas Mikolov",
            "Narjes Nikzad",
            "Meysam Chenaghlu",
            "Richard Socher",
            "Xavier Amatriain",
            "Jianfeng Gao"
        ],
        "abstract": "Large Language Models (LLMs) have drawn a lot of attention due to their strong performance on a wide range of natural language tasks, since the release of ChatGPT in November 2022. LLMs' ability of general-purpose language understanding and generation is acquired by training billions of model's parameters on massive amounts of text data, as predicted by scaling laws \\cite{kaplan2020scaling,hoffmann2022training}. The research area of LLMs, while very recent, is evolving rapidly in many different ways. In this paper, we review some of the most prominent LLMs, including three popular LLM families (GPT, LLaMA, PaLM), and discuss their characteristics, contributions and limitations. We also give an overview of techniques developed to build, and augment LLMs. We then survey popular datasets prepared for LLM training, fine-tuning, and evaluation, review widely used LLM evaluation metrics, and compare the performance of several popular LLMs on a set of representative benchmarks. Finally, we conclude the paper by discussing open challenges and future research directions.",
        "comments": "arXiv admin note: substantial text overlap with arXiv:2401.14423",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/large-language-models-a-survey",
        "bibtex": "@misc{minaee2024large,\n      title={Large Language Models: A Survey}, \n      author={Shervin Minaee and Tomas Mikolov and Narjes Nikzad and Meysam Chenaghlu and Richard Socher and Xavier Amatriain and Jianfeng Gao},\n      year={2024},\n      eprint={2402.06196},\n      archivePrefix={arXiv},\n      primaryClass={cs.CL}\n}"
    }
}